[
  {
    "title": "How Asia Cup 2025 trophy presentation turned into a diplomatic standoff",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/how-asia-cup-2025-trophy-presentation-turned-into-a-diplomatic-standoff/articleshow/124216897.cms",
    "source": "",
    "published": "2025-09-30T05:00:00+05:30",
    "text": "India’s stance had been clear throughout the tournament — the team avoided handshakes and pleasantries with Pakistani players in all three encounters. (Image credit: Agencies)\n\nInside details of how PCB chief Mohsin Naqvi ran away with the Asia Cup trophy!\n\nGo Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW!\n\nPoll Should India have accepted the Asia Cup trophy from the ACC chairman? Yes, they should have accepted it. No, they made the right decision.\n\nDUBAI: What should have been a triumphant moment for Indian cricket descended into unprecedented controversy at the Dubai International Stadium on Sunday, as the Asia Cup trophy presentation turned into a diplomatic standoff following India’s thrilling five-wicket victory over Pakistan.Rinku Singh’s match-winning runs sparked wild celebrations among the Indian contingent, with Tilak Verma’s magnificent unbeaten 69 earning him Player of the Match honours. But the jubilation was quickly overshadowed by an extraordinary post-match fiasco that saw the champions celebrating without their trophy.Following their defeat, the Pakistan team retreated to the dressing room and remained there for over an hour, while Indian players and coaching staff completed their broadcast duties. Asian Cricket Council (ACC) president Mohsin Naqvi — who also serves as Pakistan Cricket Board chairman and Pakistan’s interior minister -- and others then waited on the podium for almost 20 minutes for the trophy presentation to begin. As the delay stretched on, it emerged that the Indian team had refused to receive the trophy from Naqvi.India’s stance had been clear throughout the tournament — the team avoided handshakes and pleasantries with Pakistani players in all three encounters.The team is also believed to have been irked with Naqvi because of his recent social media posts, including one in which he posted a video of Cristiano Ronaldo making a 'crashing plane' gesture. He also reposted an image in which Pakistan cricketers Salman Agha and Shaheen Shah Afridi are seen wearing flight suits with images of airborne fighter jets in the background.The Indian team management categorically told ACC officials that they were \"not okay\" with receiving awards from Naqvi. This was conveyed to Naqvi immediately. However, Naqvi refused to budge and the Indian team also refused to walk up to the podium.The team did indicate that it was willing to accept the trophy and medals from Emirates Cricket Board vice-chairman Khalid Al Zarooni instead of Naqvi. However, the request was declined. Naqvi insisted on conducting the presentation himself. When it became clear he was not going to get his way, he ordered the trophy to be removed from the venue.Indian supporters greeted Naqvi’s arrival at the presentation stage with boos and chants of “Bharat Mata Ki Jai.” Pakistani players, particularly fast bowlers Haris Rauf and Shaheen Shah Afridi, were also jeered by the crowd.When the Pakistan team was called to collect the runners-up medals, Naqvi initially refused to take part. Bangladesh Cricket Board president Aminul Islam eventually stepped in to present them, while Naqvi handed the runners-up cheque to Pakistan captain Salman Ali Agha — who threw it aside.Commentator Simon Doull then announced, “I have been informed by the ACC that the Indian cricket team will not be collecting their awards tonight. So that concludes the post-match presentation.”Naqvi promptly left the stadium — taking the trophy and medals with him.The Indian team stayed on the field for more than 90 minutes, waiting for clarity. Groundsmen twice brought out the 'champions' board before removing it again. Eventually, the players decided to celebrate on their own terms.Hardik Pandya was first to step onto the podium for a selfie, soon joined by the entire squad and support staff. Captain Suryakumar Yadav even recreated Rohit Sharma’s iconic T20 World Cup 2024 victory walk — this time holding an imaginary trophy.“The win is important. If you saw after the match, ‘India’ was written on the big screen. ‘Asia Cup 2025 Champions’ — what’s better than that? You play for that,” Surya told the media.“It was a great moment. Great journey. Great campaign for us as a team. We had a lot of fun,\"added Surya.Surya was withering about his team not getting to hoist the trophy. “I have never seen a champion team being denied a trophy, especially one that was so hard-earned,” he said. But he was quick to add, \"My trophies are sitting in the dressing room — all 14 guys with me, the support staff — those are the real trophies of this Asia Cup.”Man of the Tournament Abhishek Sharma lightened the mood with a cheeky remark: “We actually got one. Surya bhai brought it! We felt it, we knew its weight.”Pakistan captain Salman Ali Agha, however, defended Naqvi’s position. “If he is the ACC president, then he will only give the trophy. If you don’t want to take it from him, how will you get a trophy?” Agha also accused India of disrespecting cricket.Later in the night BCCI secretary Devajit Saikia issued a sharp statement condemning the incident.“We decided not to accept the Asia Cup 2025 trophy from the ACC chairman, who represents a country currently at odds with ours. That was our stance. But this does not give him the right to take away the trophy and medals. It is extremely unfortunate and unsportsmanlike. We hope the trophy and medals are returned to India as soon as possible. We will lodge a formal protest at the ICC conference in Dubai this Nov,” Saikia told ANI in Mumbai.The drama didn't end there. After PM Modi's post on X congratulating the Indian cricket team for its victory -- which he described as another Operation Sindoor -- went viral, Naqvi posted a sharp response on the microblogging platform.\"If war were your measure of pride, history already records your humiliating defeats at Pakistan's hands. No cricket match can rewrite that truth. Dragging war into sport only exposes desperation and disgraces the very spirit of the game,\" Naqvi posted, apparently forgetting the numerous defeats suffered by Pakistan -- including the 1971 war and the Kargil conflict -- and the damage inflicted to it by Operation Sindoor.Surya, incidentally, thanked PM Modi for his support. \"It feels good when the country's leader himself bats on the front foot; it felt like he took the strike and scored runs,\" he told ANI.India–Pakistan matches remain the biggest draw for broadcasters and organisers, a guaranteed revenue generator. With the T20 World Cup looming early next year, all eyes will be on the groupings — and whether the arch-rivals are once again placed in the same pool to guarantee at least one blockbuster clash.In a heartfelt gesture, India’s T20I captain Suryakumar Yadav announced that he would donate his entire match fee from the T20 Asia Cup to the Armed Forces. Surya said the contribution was a personal initiative to honour their sacrifices and service.“It’s a gesture from me. I want to donate the match fees from all the games I’ve played in this Asia Cup to the Armed Forces,” Surya said.",
    "category": "sports"
  },
  {
    "title": "Asia Cup heroes return home: Gambhir welcomed in Ahmedabad, Surya in Mumbai – Watch",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/indias-asia-cup-heroes-return-home-gambhir-welcomed-in-ahmedabad-surya-in-mumbai-watch-videos/articleshow/124227217.cms",
    "source": "",
    "published": "2025-09-30T11:44:27+05:30",
    "text": "Indian cricketers returned home after Asia Cup 2025. (Video grabs)\n\nGo Beyond The Boundary with our YouTube channel.\n\nPoll What aspect of India's T20 Asia Cup performance impressed you the most? Team's Unbeaten Streak Composure Under Pressure Strong Leadership of Suryakumar Yadav\n\nNEW DELHI: India's cricketing heroes were greeted by fans with rapturous celebrations as they returned home following their Men's T20 Asia Cup 2025 triumph over Pakistan. Head coach Gautam Gambhir and spinner Kuldeep Yadav landed in Ahmedabad on Tuesday, a couple of days after India secured a thrilling five-wicket victory at the Dubai International Stadium.Videos of Gambhir and Yadav's arrival captured scenes of ecstatic fans taking to the streets, waving flags, and cheering loudly. Social media buzzed with images and clips showing supporters lining up to welcome the victorious contingent, celebrating India's unbeaten run in the tournament, which included seven wins and three victories over archrivals Pakistan.The celebrations come as Team India now shifts focus to the upcoming two-match Test series against the West Indies, starting October 2 at the Narendra Modi Stadium in Ahmedabad. The second Test will be held at Delhi's Arun Jaitley Stadium from October 10, forming part of the 2025-27 ICC World Test Championship cycle.Meanwhile, India captain Suryakumar Yadav touched down in his hometown Mumbai on Monday evening, accompanied by his wife.Video clips show Surya leaving Chhatrapati Shivaji Maharaj International Airport in a black SUV, as fans cheered from afar.The tournament was notable for both India's on-field brilliance and off-field decisions, including refusing the Asia Cup trophy from ACC chief Mohsin Naqvi.Other players, including Mumbai-based Shivam Dube, also reached their home cities, while the core Test squad, along with Gambhir and support staff, are already in Ahmedabad preparing for the longer format.The triumphant returns underline India's dominance in T20 cricket, with skipper Surya, Tilak Varma, and the rest of the squad hailed for maintaining composure under pressure and finishing the Asia Cup undefeated.As Ahmedabad and Mumbai bask in celebrations, the cricketing fraternity now turns its attention to the Test series, hopeful that Team India can carry forward the momentum and continue its winning streak into the longer format.",
    "category": "sports"
  },
  {
    "title": "'Ran away with the trophy': Surya slams Mohsin Naqvi after Asia Cup final drama",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/trophy-leke-bhaag-gaye-woh-suryakumar-yadav-slams-mohsin-naqvi-after-asia-cup-final-drama/articleshow/124225059.cms",
    "source": "",
    "published": "2025-09-30T09:42:56+05:30",
    "text": "Suryakumar Yadav\n\nGo Beyond The Boundary with our YouTube channel.\n\nSuryakumar Yadav explosive press conference: On Armed Forces, his poor form, controversy and more\n\nPoll What was the most memorable aspect of the Asia Cup 2025 final? India's victory The controversy Tilak Varma's performance\n\nNEW DELHI: India’s Asia Cup 2025 victory over Pakistan in Dubai ended in dramatic fashion, with captain Suryakumar Yadav alleging that Asian Cricket Council (ACC) chief Mohsin Naqvi “ran away with the trophy” after the Indian team refused to accept it from him.India clinched the final by five wickets, with Tilak Varma’s composed half-century sealing a thrilling win. But celebrations took a bizarre turn when the presentation ceremony descended into chaos.Suryakumar clarified the team’s stance, emphasising that it was a collective decision not to accept the trophy from Naqvi, who is also the Pakistan Cricket Board chairman and Pakistan’s interior minister.“I think this is one thing which I have never seen since I started playing and following cricket — that a champion team is denied a trophy. I mean that too a hard-earned one. We have been here since September 4, we played a game today, two back-to-back good games in two days. I feel we deserved it,” he said in reply to PTI’s query.A video that surfaced online showed an official removing the trophy after Naqvi walked away, while Pakistan players’ late arrival further delayed the ceremony.Eventually, runners-up medals were distributed to Pakistan players, and India celebrated without the silverware in hand.Surya, while speaking to ANI, also offered a heart-warming perspective on what he considers the real rewards of victory: “I won’t call it controversy. The real trophy is when you win the hearts of people, the players, the trust you earn, the support staff, the work of so many people on the field. My trophies are sitting in my dressing room — all 14 guys with me, all the support staff. Those are the real trophies. These are the moments I’m taking back as lovely memories which will stay with me forever. ”The skipper also later posted on ‘X’: “When the game is done, only the champions will be remembered and not the picture of a trophy.”BCCI secretary Devajit Saikia confirmed that the board will file a formal complaint against Naqvi’s actions, calling the incident “unprecedented and unacceptable.”While the team’s on-field brilliance earned India their ninth Asia Cup crown, the final will be remembered as much for the off-field theatrics as for the thrilling cricketing display.",
    "category": "sports"
  },
  {
    "title": "'Gutted and heartbroken' – Hardik Pandya’s painful confession after missing India’s historic Asia Cup win",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/gutted-and-heartbroken-hardik-pandyas-painful-confession-after-missing-indias-historic-asia-cup-win/articleshow/124226245.cms",
    "source": "",
    "published": "2025-09-30T10:49:47+05:30",
    "text": "India's Hardik Pandya (AP/PTI)\n\nBCCI secretary Devajit Saikia reacts to trophy controversy after Asia Cup 2025 final\n\nIndian cricket all-rounder Hardik Pandya expressed disappointment at missing the Asia Cup 2025 final against Pakistan due to a left quadriceps injury, where India secured their ninth title with a five-wicket victory. Pandya, who participated in all six matches leading up to the final before being replaced by Rinku Singh , shared his thoughts on India's successful campaign in a video released by the Board of Control for Cricket in India ( BCCI ).\"I was very gutted to miss the most important game, but the way the boys played was outstanding. They showed a lot of character,\" Pandya said in the BCCI video.India demonstrated their dominance throughout the tournament, maintaining an undefeated streak and successfully chasing down the target of 147 runs in 19.4 overs during the final match.\"These games are going to help us in the long run where we will be tested, we will be put under pressure. The way we held our nerves was fantastic,\" Pandya commented on the team's performance.The tournament showcased India's ability to adapt and perform under pressure, with only a few matches presenting significant challenges to the team.\"T20 cricket is about that, come and dominate, play a fearless brand, and at the same point of time learn and adapt, I think this team is learning that,\" Pandya reflected on the team's approach.A standout performer in the tournament was opener Abhishek Sharma , who accumulated over 300 runs with an impressive strike rate of 200, contributing significantly to India's success.\"Outstanding effort by Abhishek from the top – the way he played and the fearlessness he showed, half of the game he won for us in the Power Play itself,\" Pandya praised his teammate's performance.Pandya's own contribution to the tournament included taking four wickets in six matches at an economy rate of 8.57, sharing new ball duties with pace bowler Jasprit Bumrah .\"I have always enjoyed any role that I am given, and this time I was handed over the new ball, which I really enjoyed. Batting has always been there, whenever the team requires, as that's the way I like to bat,\" Pandya shared about his role.The all-rounder emphasized his commitment to bowling, highlighting it as his primary focus in recent times.\"Bowling has been my No. 1 priority for a long time now, if Hardik Pandya bowls then batting is never a problem. I treat myself as a pure fast bowler and I have taken a lot of pride in that. It's a lot of hard work, a lot of discipline, and it has been a constant which I really enjoy,\" Pandya elaborated on his bowling priorities.The victory marked India's record-extending ninth Asia Cup title, reinforcing their dominance in continental cricket competitions.",
    "category": "sports"
  },
  {
    "title": "'PCB wants lallu-kattu kids': Akhtar slams Pakistan cricket after Asia Cup loss",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/pcb-wants-obedient-lallu-kattu-kids-shoaib-akhtar-slams-pakistan-cricket-after-asia-cup-2025-loss/articleshow/124226207.cms",
    "source": "",
    "published": "2025-09-30T11:13:01+05:30",
    "text": "Pakistan's captain Salman Agha talks to his teammates. (AP/PTI Photo)\n\nGo Beyond The Boundary with our YouTube channel.\n\nIndia vs Pakistan breaks out between journalists in Dubai during Salman Agha press conference\n\nPoll Do you agree with Shoaib Akhtar's criticism of the Pakistan Cricket Board (PCB)? Yes, I completely agree. No, I disagree. I'm not sure.\n\nNEW DELHI: Legendary fast bowler Shoaib Akhtar did not hold back in a scathing post-mortem of Pakistan’s Asia Cup 2025 final loss to India, hitting out at the team management, captain Salman Ali Agha, coach Mike Hesson, and the Pakistan Cricket Board (PCB).Akhtar highlighted what he sees as systemic flaws in Pakistan cricket that have left the team lacking aggression and character.“Humey ab shareef bacche chahiyen, jo aaath baje curfew legake ghar pey bait jaayen. Cricket board ko in jaisey bechare, lallu-kattu chahiye. They don’t want strong personalities. This is the reflection of the PCB policies,” Akhtar said on ARY News , using his trademark blunt style.The former speedster criticised captain Salman Agha for failing to inspire, saying, “Where will the attitude come when the captain is not inspiring? The captain is a reflection of the board’s choices.” He also blamed coach Mike Hesson for sticking to “half-baked allrounders” instead of backing match-winners like Hasan Nawaz.“Senseless and headless-chicken management. The team combinations weren’t right, the captaincy wasn’t spot-on, and they weren’t willing to listen to us,” he added.Akhtar used humour to underline his point about Pakistan’s vanishing fast-bowling heritage. He lamented the shift from aggressive talent to “obedient kids” who are easier to manage, claiming the PCB has discouraged strong personalities.He also discussed why he has avoided cricket administration after retirement: “From the first day after my retirement, I had decided I will never join PCB as whoever has gone there has never come out with respect. I work in TV, take money, and sit. These guys don’t want strong personalities.”Akhtar’s analysis of Pakistan’s Asia Cup final highlighted poor strategic decisions, including dropping Hasan Nawaz, questionable bowling changes, and a fragile middle order. He criticised giving Haris Rauf the final over, which leaked 17 runs, calling it a “big mistake.”He also proposed reforms to the PCB, advocating grassroots development, regional teams, and a PSL 2.0 to nurture young talent — contrasting Pakistan’s system with India’s well-structured domestic pathway.“Now there is Mohsin Naqvi, next time koi aur saab aa jayenge. Unless you bring in a visionary educated man… history will remember if you start this,” Akhtar said.For Shoaib Akhtar, the Asia Cup 2025 final was more than a loss on the scoreboard — it symbolised the failures of a system that, in his view, values obedient players over true cricketing talent.",
    "category": "sports"
  },
  {
    "title": "Tilak Varma’s coach reveals secrets behind match-winning Asia Cup knock against Pakistan",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/tilak-varmas-coach-reveals-secrets-behind-match-winning-asia-cup-knock-against-pakistan/articleshow/124227660.cms",
    "source": "",
    "published": "2025-09-30T12:14:36+05:30",
    "text": "Tilak Varma of India (Photo by Francois Nel/Getty Images)\n\nHyderabad:\n\nAbhishek Sharma press conference: On support from Gautam Gambhir, intent, winning car, no trophy\n\nTilak Varma anchored India’s five-wicket win over Pakistan in the Asia Cup final on Sunday with his unbeaten 69 (53b, 3x4, 4x6), helping India chase down 147. Unfazed by the loss of early wickets, Tilak added 57 for the fourth wicket with Sanju Samson and 60 for the fifth with Shivam Dube.Tilak has been in similar situations for Mumbai Indians in the Indian Premier League (IPL) knockouts — he scored 207 runs in five innings at a strike rate of over 160 — but playing against Pakistan in a high-voltage game called for the steely resolve the Hyderabadi displayed.The 22-year-old has enviable numbers in T20I chases — 370 runs in 11 innings, an average of 92.50, and a strike rate of 134.54 with three fifties. In the Asia Cup, Tilak totalled 213 runs in six innings with a strike rate of 131.48, India’s second-highest run-getter after Abhishek Sharma ’s 314 runs.“There was pressure. They were bowling well. They were mixing up the pace. I was breathing and trying to stay calm. One of the most special knocks of my life. Chak De India,” said the elated cricketer after the match.“We have prepared for every position. You should be flexible. I was prepared to bat at any order. I was backing my game,\" he added.Back home in Hyderabad, his childhood coach Salam Bayash at the Legala Cricket Academy revealed the hard work the player put in to become a match-winner for India.“To play such an innings in the Asia Cup final against Pakistan in such a situation is extremely satisfying. Tilak has become a national hero with the innings,\" said the excited coach. “He has worked hard on his game since his debut two years ago. Even before the match, I spoke to him and told him to never leave the match unfinished. I am happy to see his hard work paying off,” Bayash added.“Tilak used to be aggressive in his approach and lose his wicket. He bats at a position where he has to finish the match. So, he learnt to play according to the match situation quickly,” Bayash further explained.Before the Asia Cup, Tilak was playing red-ball cricket for Hampshire County. He had very little time to adjust to white-ball cricket. “After coming from county cricket, we had two days' time and we prepared pitches that suited the Dubai conditions and practised on them. He also worked on his back-foot shots. That did help him,” he revealed.His coach believes that Tilak is an all-format player and has much to offer in Tests. “I have been saying this. He is an all-format player and red-ball cricket is his strong suit. Hope he gets his chance in Tests.”",
    "category": "sports"
  },
  {
    "title": "'Ashamed': WC-winning ex-India player slams politics, gestures in Asia Cup",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/ashamed-as-a-cricketer-world-cup-winning-ex-india-player-slams-politics-provocative-gestures-in-asia-cup-2025/articleshow/124225714.cms",
    "source": "",
    "published": "2025-09-30T10:14:29+05:30",
    "text": "Team India celebrates after winning the Asia Cup. (AP Photo)\n\nGo Beyond The Boundary with our YouTube channel.\n\nSuryakumar Yadav explosive press conference: On Armed Forces, his poor form, controversy and more\n\nPoll Do you agree with Syed Kirmani's view that modern cricket lacks sportsmanship? Yes, completely Somewhat agree No, not really\n\nNEW DELHI: World Cup-winning former India wicketkeeper Syed Kirmani has expressed deep disappointment at the lack of sportsmanship in modern cricket, saying he felt “ashamed” after hearing friends from abroad describe the Asia Cup 2025 as a tournament marred by politics rather than sporting spirit.Speaking to ANI, Kirmani lashed out at the provocative gestures made by Pakistan players during their clashes with India, and the tit-for-tat responses that followed. He also lamented India’s refusal to accept the trophy from Asian Cricket Council (ACC) chief and Pakistan minister Mohsin Naqvi after winning the final in Dubai, calling the episode “disgusting” for the game.“By and large, there has been no gentlemanness in the game. Very rude, arrogant gestures on the field. I am ashamed myself to listen to the comments of my friends from outside India. They said our time was different, we played like gentlemen. But what has happened at the Asia Cup is disgusting. These are their words,” Kirmani said.The former cricketer recalled how India-Pakistan ties were once built on camaraderie and respect, irrespective of political tensions.“Our time as cricketers, we had such wonderful camaraderie. Pakistani players coming into India, we going into Pakistan — what hospitality, what love, what affection. Exchanging pleasantries, families meeting at parties. Where is that now? The total scenario from our time to this era is absolutely depressing according to me,” he said.The Asia Cup final ended in bizarre scenes when the Indian team refused to receive the trophy from Naqvi, who left the ceremony with the silverware. Videos of officials carrying the trophy away shocked fans worldwide.Kirmani stressed that politics should never find a place in sport.“Politics should not enter sports. Leave politics behind. Whatever has transpired away from the sporting field, leave it there itself. Cricket should not be used for such things,” he added.India may have won their ninth Asia Cup title, but as Kirmani put it, the tournament will be remembered less for cricketing excellence and more for the controversies that overshadowed it.",
    "category": "sports"
  },
  {
    "title": "Watch: Hero's welcome! Tilak Varma gets rousing reception after final heroics",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/heros-welcome-in-hyderabad-tilak-varma-gets-rousing-reception-after-asia-cup-2025-final-heroics-watch/articleshow/124224698.cms",
    "source": "",
    "published": "2025-09-30T09:06:00+05:30",
    "text": "Tilak Varma at Hyderabad airport. (Video grab)\n\nGo Beyond The Boundary with our YouTube channel.\n\nIndia cricketers return home after winning Asia Cup 2025 title in Dubai\n\nWATCH:\n\nPoll Which aspect of Tilak Varma's playing style impresses you the most? His striking ability Calmness under pressure Consistency in chases\n\nInside details of how PCB chief Mohsin Naqvi ran away with the Asia Cup trophy!\n\nWATCH:\n\nIndia’s Asia Cup 2025 final hero Tilak Varma was greeted with a thunderous reception in his hometown Hyderabad after his match-winning knock against Pakistan in Dubai. A video of the 22-year-old arriving at the airport and later spotted in his car went viral on social media, showing fans going absolutely berserk as they cheered and beat dhols to celebrate the local boy’s return.Tilak, who was the star of the high-pressure final at the Dubai International Stadium on Sunday, produced an innings of rare composure and brilliance. Coming in when India was struggling at 10/2 in pursuit of 147, the left-hander anchored the chase with an unbeaten 69 off 53 deliveries, decorated with three fours and four sixes. His crucial partnerships with Sanju Samson and Shivam Dube turned the tide and ensured India lifted their ninth Asia Cup title with two balls to spare.Back home, the scenes were nothing short of euphoric. Hundreds of fans lined up outside the airport, shouting his name as he waved back from inside his car. The video of this grand welcome, circulating widely online, perfectly captured the pride of Hyderabad in celebrating one of its brightest cricketing stars.The southpaw’s record in crunch matches continues to underline his temperament. In knockout games for both India and Mumbai Indians in the IPL, Tilak has amassed 207 runs in five innings at a strike rate of over 160.His consistency in T20I chases is equally staggering — 370 runs in 11 innings at an astonishing average of 92.50.In the Asia Cup, Tilak finished as India’s second-highest run-scorer with 213 runs in six innings at an average of 71.00, behind only Abhishek Sharma. Overall, in 32 T20Is, he already has 962 runs at 53.44, including two centuries.For Indian fans, however, his unbeaten 69* in the final will be remembered as the innings that sealed glory against arch-rivals Pakistan. And for Hyderabad, it was a moment to embrace their homegrown hero in grand style.",
    "category": "sports"
  },
  {
    "title": "Nepal shatter multiple records with emphatic 90-run win against West Indies",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/news/giant-killers-nepal-shatter-multiple-records-with-emphatic-90-run-win-against-west-indies/articleshow/124226454.cms",
    "source": "",
    "published": "2025-09-30T11:18:32+05:30",
    "text": "Nepal script series win over West Indies (X)\n\nNepal cricket team made history by defeating West Indies in a T20I bilateral series at the Sharjah Cricket Ground on September 29, securing an unassailable 2-0 lead with a 90-run victory in the second match. The Rohit Paudel-led side achieved multiple milestones, including becoming the first associate team to win a bilateral series against West Indies in any format and setting a record for the biggest victory margin by a non-Test playing team.Nepal won the toss and chose to bat first, posting a total of 173 runs despite losing three early wickets. Asaif Sheikh and Sundeep Jora contributed with half-centuries to build the competitive total.The West Indies batting lineup collapsed under Nepal's bowling attack, getting dismissed for just 83 runs. Mohammad Aadil Alam emerged as the leading bowler with four wickets, while Kushal Bhurtel supported with three wickets.This victory marks Nepal's first series win over a full-member team across any format. While Nepal has previously competed against Test-playing nations in multi-national tournaments, this was their first bilateral series against such opposition.The margin of victory surpassed the previous record held by Afghanistan, who had defeated Zimbabwe by 81 runs in 2016, before becoming a Test-playing nation in 2017. Among current associate nations, Namibia held the previous record with a 55-run victory over Sri Lanka in the 2022 T20 World Cup.Nepal's triumph comes after their disappointment of failing to qualify for the 2025 Asia Cup , which featured three associate teams for the first time in its history. The team had also come close to defeating South Africa in the 2024 T20 World Cup, losing in a last-over thriller.The Asian team now looks forward to the Asian-EAP qualification tournament for the 2026 T20 World Cup, scheduled to take place in Oman from October 8-17.For West Indies, this defeat adds to their recent struggles in international cricket. The Caribbean team faces India in a two-match Test series in three days, coming off a challenging year that included being bowled out for 26 runs against Australia in a Test match and suffering a 5-0 T20I series defeat to the same opposition at home.The series began with Nepal's 19-run victory over West Indies in the first T20I on September 27, setting the stage for their historic achievement in the second match.",
    "category": "sports"
  },
  {
    "title": "'Gussa ho rhe ho aap': Suryakumar Yadav destroys Pakistani journalist after Asia Cup glory",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/gussa-ho-rhe-ho-aap-suryakumar-yadav-destroys-pakistani-journalist-after-asia-cup-glory/articleshow/124216492.cms",
    "source": "",
    "published": "2025-09-30T05:01:00+05:30",
    "text": "Suryakumar Yadav (AFP Photo)\n\nIndia vs Pakistan breaks out between journalists in Dubai during Salman Agha press conference\n\nGo Beyond The Boundary with our YouTube channel. SUBSCRIBE NOW!\n\nPoll Do you believe that sports should be free from political influence? Yes No\n\nNEW DELHI: India’s T20 captain Suryakumar Yadav addressed the controversy that erupted during the Asia Cup 2025 final after his team refused to shake hands with Pakistani players and declined to accept the trophy from Pakistan Cricket Board (PCB) chief Mohsin Naqvi. The incident sparked a debate over whether politics was being brought into cricket during the post-match press conference.The Indian team’s decision to boycott handshakes with Pakistan throughout the tournament had already attracted criticism from Pakistani journalists, who accused the players of violating the spirit of the game.Matters escalated further when the Indian side refused to receive the Asia Cup trophy from Naqvi — Pakistan’s Interior Minister and Asian Cricket Council (ACC) president — known for his reported anti-India remarks.As a result, Naqvi left the venue with the trophy, and the Indian players were left celebrating with an “imaginary” one.During the press conference, a Pakistani journalist confronted Surya with a series of questions regarding the team’s conduct, asking: “Today you are champions, you played a great game. But the question is, throughout this tournament your behavior towards the Pakistan team has been noticed — you didn't do handshakes, you didn't take part in the photo session with the trophy, then you held a political press conference.Do you think that in the history of cricket you are the first captain who has brought politics into the game of cricket?”Despite attempts by the Indian media manager to stop him from responding, Yadav replied: “Do I have to answer or not? Gussa ho rahe ho aap (You're getting angry). I couldn't even understand your question — you asked four questions at the same time.”Following the tournament, Yadav announced that he would donate his match fees to the Indian Army, stating: “I want to give my match fees from all the games which I have played in this tournament to the Indian Army.”The episode highlighted the growing tensions between the two cricketing nations, with the handshake boycott and trophy presentation controversy dominating discussions. India’s triumph in the Asia Cup 2025 was ultimately overshadowed by the diplomatic flashpoints that emerged during the tournament.",
    "category": "sports"
  },
  {
    "title": "R Ashwin takes a sly dig at Haris Rauf after India’s Asia Cup win",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/r-ashwin-takes-a-sly-dig-at-haris-rauf-after-indias-asia-cup-win/articleshow/124223223.cms",
    "source": "",
    "published": "2025-09-30T07:09:49+05:30",
    "text": "Pakistan's Haris Rauf (AP /PTI)\n\nAbhishek Sharma press conference: On support from Gautam Gambhir, intent, winning car, no trophy\n\nFormer India off-spinner Ravichandran Ashwin praised Tilak Varma's match-winning innings of 69 not out in the Asia Cup 2025 final against Pakistan in Dubai on Sunday, where India successfully chased down 147 runs with five wickets remaining and two balls to spare. Varma's composed knock helped India recover from a precarious position of 20/3, while India's spinners Kuldeep Yadav and Varun Chakaravarthy played crucial roles in restricting Pakistan after their strong start. Ashwin highlighted Varma's ability to handle pressure and his skillful play against both pace and spin bowling during the chase.\"Tilak Varma absolutely stole the show. He showed that he made of veins of ice. Outstanding knock. India were in a very precarious situation. Thanks to Haris Rauf, we won the match easily,\" Ashwin said on his YouTube channel.The former spinner elaborated on Varma's technical prowess during the innings, particularly noting his adaptability to the playing conditions.\"Tilak Varma soaked the pressure. He played spin really well. He played sweeps, he was able to hit down the ground. He realised that the bounce on the wicket was a little sticky and started playing square off the wicket.People think that it is easy to hit this shot (six to Rauf) but falling in the line and picking it up is difficult,\" he added.The match saw significant contributions from India's spin bowling duo of Kuldeep Yadav and Varun Chakaravarthy, who helped contain Pakistan's innings after a strong start.\"I would like to give credit to Varun Chakaravarthy and Kuldeep Yadav. It was a next level comeback. Sahibzada Farhan and Fakhar Zaman gave them a superb start. However, this is difference between Pakistan and Sri Lanka. Sri Lanka handed our spinners beautifully and even made the right shot selection. If you look at teams in Asia, Pakistan have very good players of spin. However, it is big match pressure. There are many people in the Indian team who can face this pressure,\" Ashwin said.Kuldeep Yadav emerged as the tournament's leading wicket-taker with 17 wickets in seven matches at an average of 9.29.Ashwin provided insights into why Kuldeep Yadav was particularly effective in the tournament, citing the unique characteristics of Dubai's pitches.\"The reason Kuldeep Yadav bowled so well was because, the shot that Sanju got out, the same shot in IPL in Jaipur would have been a six over extra cover. In Dubai, when you bowl slow, the ball sits down and becomes lumpy with more bounce. It takes a top edge. See the example of Saim Ayub, he tried to cut it but it took an edge and Bumrah caught it at point. Wickets like this would never fall in the IPL. Think carefully. That is probably the difference,\" he explained.The victory marked a significant achievement for the Indian team under Suryakumar Yadav 's leadership, with both batting and bowling departments contributing to the successful campaign.The tournament showcased India's depth in both batting and spin bowling departments, with young players like Tilak Varma stepping up in crucial situations and experienced bowlers like Kuldeep Yadav maintaining consistent performances throughout the competition.",
    "category": "sports"
  },
  {
    "title": "Former Pakistan pacer Mohammad Amir breaks down emotionally after India’s Asia Cup win – Watch",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/former-pakistan-pacer-mohammad-amir-breaks-down-emotionally-after-indias-asia-cup-win-watch/articleshow/124225298.cms",
    "source": "",
    "published": "2025-09-30T09:54:04+05:30",
    "text": "Pakistan's cricket players stand for their national anthem (AP Photo/Altaf Qadri)\n\nPakistan fans are heartbroken as their team lose to India, AGAIN. 'Next time', they say!\n\nFormer Pakistani fast bowler Mohammad Amir shared an emotional video reaction on social media platform X after Pakistan 's loss to India in the Asia Cup 2025, where India successfully chased down 147 runs despite early setbacks, with Tilak Varma scoring an unbeaten 69 to guide his team to victory.The left-arm pacer expressed his disappointment through a video message where he appeared visibly emotional with shaking voice and moist eyes while analyzing Pakistan's defeat against their arch-rivals.Amir began his analysis by stating: \"Yaar, hum ne plate mein rakh ke de diya match. Yeh bohot bada mauka tha, hum jeet sakte the. India ne toss jeet kar humein batting di, achha tha. Final mein humesha pehle batting karni chahiye.\"Click here to watch Mohammad Amir's reaction The former Pakistani bowler emphasized how Pakistan squandered their strong position in the match. He pointed out that Pakistan had reached a commanding position of 113/1 within 11-12 overs with both openers well set at the crease.Amir further elaborated: \"Runs on the board, specially T20 mein, pressure hota hain. Itna achha start, 11-12 overs mein 113/1, dono openers set. Phir samajh nahi aayi ke hua kya.146 T20 defend nahi hota hai, bhai.\"The match saw Pakistan collapse from a strong position of 100/1 to eventually being dismissed for 146 runs, leaving their bowlers with a challenging task of defending a modest total.Pakistan's bowlers did make early inroads into the Indian batting lineup, reducing them to 20/3 within the first four overs of the chase.However, India managed to recover through crucial partnerships, with Tilak Varma playing a match-winning knock of 69 not out to secure the victory for his team.Amir's analysis highlighted a crucial aspect of modern T20 cricket, suggesting that totals around 140-150 are no longer considered competitive in the current era of the game.The former pacer's cricketing assessment emphasized how a single substantial partnership can overcome such modest targets in contemporary T20 matches.Pakistan's inability to capitalize on their strong start and convert it into a more substantial total ultimately proved decisive in the final outcome of the match.The match served as another chapter in the historic cricket rivalry between India and Pakistan, with India emerging victorious through a well-executed chase despite early setbacks.The defeat particularly stung for Pakistan as they had a golden opportunity to secure a rare victory against their traditional rivals after being in a commanding position for a significant portion of the match.",
    "category": "sports"
  },
  {
    "title": "Pakistan player recalls getting scammed by government: 'PM's cheques of PKR 25 lakh bounced'",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/news/pakistan-player-recalls-getting-scammed-by-government-pms-cheques-of-pkr-25-lakh-bounced/articleshow/124216618.cms",
    "source": "",
    "published": "2025-09-30T05:05:00+05:30",
    "text": "Pakistan's captain Salman Agha (AP Photo/Altaf Qadri)\n\nPakistan fans are heartbroken as their team lose to India, AGAIN. 'Next time', they say!\n\nPoll Did you enjoy India's performance in the 2025 Asia Cup final? Absolutely, they were outstanding! Not really, it was predictable.\n\nIndia’s record-extending ninth Asia Cup triumph has not only dominated cricket headlines but also triggered renewed discussions across the border.Soon after India’s five-wicket victory over Pakistan in the 2025 final in Dubai, an old video of former Pakistan spinner Saeed Ajmal resurfaced on social media, drawing sharp reactions from fans.In the clip from a 2023 podcast with Nadir Ali, Ajmal recalled how Pakistan’s 2009 T20 World Cup-winning squad was promised cheques of PKR 25 lakh each by then Prime Minister Yusuf Raza Gilani.While the players were delighted at the reward, Ajmal revealed that the cheques later bounced.“In the clip from a 2023 podcast with Nadir Ali, Ajmal recalled how Pakistan’s 2009 T20 World Cup-winning squad was promised cheques of PKR 25 lakh each by then Prime Minister Yusuf Raza Gilani. While the players were delighted at the reward, Ajmal revealed the cheques later bounced,” Ajmal said in the podcast.\"I was shocked that even a government cheque could bounce. We were told the PCB chief would handle it, but they also refused, saying it was the government’s promise. In the end, the only money we got was from the ICC.\"Ajmal’s comments, resurfacing just after India’s Asia Cup glory, have reignited debate about the contrasting ways in which cricket boards treat their players.While Ajmal lamented broken promises, the BCCI announced a cash prize of Rs 21 crore for the Indian squad immediately after their Asia Cup victory on Sunday.Ajmal, who took 12 wickets in Pakistan’s 2009 campaign, remains one of the country’s most successful spinners despite his career ending in 2015 following an ICC suspension over his bowling action.",
    "category": "sports"
  },
  {
    "title": "India Women aim to kickstart World Cup campaign with win over Sri Lanka",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/icc-womens-world-cup-2025/india-women-aim-to-kickstart-world-cup-campaign-with-win-over-sri-lanka/articleshow/124227064.cms",
    "source": "",
    "published": "2025-09-30T11:32:43+05:30",
    "text": "Guwahati: India's Smriti Mandhana with teammates during a training session ahead of the ICC Women's Cricket World Cup 2025 (PTI Photo/Swapan Mahapatra)\n\nGuwahati:\n\nFinishing runners-up twice before, Harmanpreet Kaur-led India will look to start their quest for their maiden ICC Women’s ODI World Cup trophy on a winning note when they face co-hosts Sri Lanka in the tournament opener here on Tuesday.India will try to make the most of the home advantage in the 13th edition of the tournament, which returns to the country after 12 years. They will also aim to bury the ghost of finishing second-best, which they did in 2005 and 2017. In 2005, India endured a heavy defeat against seven-time world champions Australia, while in 2017 it was a narrow nine-run loss to the English women.Enjoying a one-sided record over their continental opponents Sri Lanka in ODIs, a win in the opening game at Barsapara Cricket Stadium will help the Indian women set the tone for the long tournament. In 35 ODIs against Sri Lanka, India have won 31, Sri Lanka have won three, and there was no result on one occasion.Despite their recent hard-fought 1-2 bilateral series loss to the Australia Women in the lead-up to the marquee eight-team ICC event, India will start the game as firm favourites against the Lankans. Before the Australia series, Kaur and Co. had beaten four-time ODI World Cup champions England in ODI and T20I series.World No. 3 India’s batting will largely revolve around Smriti Mandhana . The vice-captain is in red-hot form with back-to-back centuries against the Aussies, and it was due to her heroics that India almost chased down 413 in the final ODI in New Delhi. Young opener Pratika Rawal, captain Kaur, wicketkeeper Richa Ghosh, and fit-again Jemimah Rodriguez will be the other batters India will bank upon.Pacer Renuka Singh ’s timely return from a stress fracture injury will also give India a boost for the World Cup. She will spearhead the pace attack, which is young and thin on experience — Kranti Gour, Arundhati Reddy, and Amanjot Kaur. Traditionally offering more support to the spinners, it will be interesting to see how the home conditions benefit the Indian team.",
    "category": "sports"
  },
  {
    "title": "Abhishek Sharma shares heartfelt moment with Yuvraj Singh after Asia Cup triumph",
    "url": "https://timesofindia.indiatimes.com/sports/cricket/asia-cup/abhishek-sharma-shares-heartfelt-moment-with-yuvraj-singh-after-asia-cup-triumph/articleshow/124223055.cms",
    "source": "",
    "published": "2025-09-30T05:53:28+05:30",
    "text": "Abhishek Sharma and Yuvraj Singh (Instagram and PTI)\n\nAbhishek Sharma Insta Post\n\nAbhishek Sharma press conference: On support from Gautam Gambhir, intent, winning car, no trophy\n\nPoll What do you think contributed most to India's victory over Pakistan? Teamwork Individual performances\n\nIndia's rising cricket star Abhishek Sharma shared a celebratory moment on Instagram with his mentor Yuvraj Singh after winning the Player of the Tournament award at the Men's T20 Asia Cup 2025. The photo, taken inside the flight returning from Dubai, shows Sharma holding his trophy alongside Yuvraj , with the caption \"No Caption Needed\" following India's five-wicket victory over Pakistan in the final.The image captured the post-victory celebrations after India's triumph at the Dubai International Stadium, prompting fans to flood social media with congratulatory messages.Sharma's outstanding performance throughout the tournament included scoring 314 runs in seven matches at an average of 44.85 and a strike rate of 200, consistently providing strong starts and forming crucial partnerships with vice-captain Shubman Gill .Sharma's family members had disclosed to IANS that Yuvraj Singh maintained regular contact with the India opener during the Asia Cup , discussing his performances and strategies for facing opposition bowlers.Upon receiving the Player of the Tournament award, which included a new car, Sharma expressed his satisfaction, stating that \"getting a car was always a pleasure.\"The photo highlights the special mentor-mentee relationship between Yuvraj Singh and Sharma, offering fans a glimpse into the personal side of international cricket rarely seen by the public.Yuvraj Singh, known for mentoring young Indian cricket talents, has been instrumental in developing Sharma's all-round abilities.The victory celebrations mark a significant achievement for the Indian cricket team, though their focus now shifts to the upcoming Test series against the West Indies, scheduled to begin on October 2 at the Narendra Modi Stadium in Ahmedabad.The transition to Test cricket will require Sharma and his teammates to adapt their playing style as India prepares for the 2025-27 ICC World Test Championship cycle.The flight photograph has become a meaningful momento for cricket fans, symbolizing India's latest success in international cricket and showcasing the emerging talent in the national team.",
    "category": "sports"
  },
  {
    "title": "Rinku Hooda and Sundar Singh Gurjar secure historic 1-2 for India at World Para Athletics Championships",
    "url": "https://timesofindia.indiatimes.com/sports/more-sports/athletics/rinku-hooda-and-sundar-singh-gurjar-secure-historic-1-2-for-india-at-world-para-athletics-championships/articleshow/124227246.cms",
    "source": "",
    "published": "2025-09-30T11:54:28+05:30",
    "text": "New Delhi, Sep 29 (ANI): Para javelin throwers Rinku Hooda and Sundar Singh Gurjar (ANI Photo/Ishant Chauhan)\n\nNew Delhi:\n\nIndia hosts first-ever World Para Athletics Championships | How is the mood inside camp?\n\nTwo unfortunate accidents, which resulted in lifelong disability, didn’t deter India’s leading differently-abled javelin throwers Rinku Hooda and Sundar Singh Gurjar from achieving a momentous 1-2 for the country at the ongoing World Para Athletics Championships here.In a dominant display on a humid evening, Rinku and Sundar gave the home crowd extra reason to cheer by claiming gold and silver in the men’s javelin throw F46 final. The F46 classification in javelin throw is for athletes with arm deficiency, impaired muscle power, or impaired passive range of movement, who compete in a standing position.India missed out on a podium sweep as Paris Paralympics silver medallist Ajeet Singh Yadav finished fourth with a best effort of 61.77m. Cuba’s Guillermo Varona Gonzalez secured bronze with 63.34m. Rinku sealed the top podium spot with a huge throw of 66.37m in his fourth attempt, while Sundar heaved his spear to 64.76m in the fifth round to claim silver.After the competition, the 26-year-old Rinku celebrated by copying football legend Ronaldo ’s victory style, running towards the stand where Indian fans were seated, jumping and twisting in the air before landing with outstretched arms.En route to his gold, Rinku also broke the 10-year-old Championships record held by China’s C Guo, who threw 61.89m.“It was always my dream to win the World Championships gold medal. I waited for this moment for a long time. At the 2023 edition, I finished second and it was kind of heartbreaking for me. Today, my whole family was there in the stands cheering for me. Winning in front of them is special. I have always admired Ronaldo. He is a big inspiration for me. I always wanted to mimic his victory celebration and today, after winning the gold, I did just that,” Rinku said. Rinku, from village Dhamar near Haryana’s Rohtak, lost his left arm in an accident at the age of three and does not consider his disability a weakness.Sundar, aged 29, gave a strong contest, initially overtaking Rinku with a throw of 64.11m in his third attempt, but was surpassed by Rinku’s subsequent throw. Although Sundar holds the world record of 68.60m in the event, he settled for silver after fouling his sixth and final attempt.“I tried hard but the throw which I was looking for didn’t come. I was experiencing some stiffness in my body. I last won the World Championships gold in 2017 and today I was looking to claim my second top podium finish in front of the home crowd. It didn’t happen, but I am happy with my performance and elated for Rinku who deserved it,” Sundar said. Sundar, from Rajasthan’s Karauli district, transitioned to the F46 category after a tragic accident that resulted in the amputation of his left hand.Sundar competed in the general category until 2015 before the accident changed everything. A tin roof fell on him at his home, leading to the amputation of his left hand. Gurjar didn’t give up on his sports dreams and enrolled as a para athlete. Sundar once competed alongside Olympic and world champion Neeraj Chopra in 2013 at the National Youth Athletics Championships in Guntur. At that meet, Sundar finished with bronze while Neeraj claimed silver.",
    "category": "sports"
  },
  {
    "title": "Seshaasai Technologies shares slump 7% post listing. Should investors buy the dip?",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/seshaasai-technologies-shares-slump-7-post-listing-should-investors-buy-the-dip/articleshow/124228074.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 12:17:43 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Seshaasai Technologies , a technology-driven multi-location solutions provider to the BFSI industry , tumbled nearly 7% from their listing price on Tuesday, post-debut, erasing early gains and raising questions for investors.The stock listed at Rs 436 on the BSE , a modest 3.07% premium over its IPO price of Rs 423, and at Rs 432 on the NSE , a 2.13% premium.However, the euphoria was short-lived as the stock slipped to an intraday low of Rs 405.80 on the BSE , marking a 6.9% fall from the listing level.The sharp reversal, despite the IPO’s strong subscription numbers, has left investors assessing whether this correction presents a buying opportunity. In such a case, should investors now buy this dip?According to Prashanth Tapse, Senior VP (Research), Mehta Equities , the muted listing of Seshaasai Technologies came as a surprise given its strong fundamentals, reasonable valuations, and robust demand, with the IPO being subscribed nearly 70 times overall and QIBs subscribing close to 190 times.He attributed the lacklustre performance more to prevailing market sentiment than to company-specific issues.Tapse said that he remains positive on the company’s long-term prospects, citing its leading position in payments and communication solutions and a 31.9% market share among payment card manufacturers in India.With ongoing drivers such as financial inclusion, increasing payment card penetration, and regulatory-driven digitization, coupled with capacity expansion in payment cards and RFID tags, Seshaasai is well-positioned for sustained growth.He advised investors who were allotted shares to ‘Hold’ and suggested that long-term participants could look at accumulating on dips, as the company stands to benefit significantly from India’s evolving fintech and BFSI ecosystem.",
    "category": "economics"
  },
  {
    "title": "Dollar/rupee one-day swap rate surges on quarter-end flows; spot flat",
    "url": "https://economictimes.indiatimes.com/markets/forex/dollar/rupee-one-day-swap-rate-surges-on-quarter-end-flows-spot-flat/articleshow/124227933.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 12:09:12 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe one-day dollar/rupee swap rate climbed on Tuesday on the back of flows related to the quarter-end, while the spot rate was little changed amid weak Asian cues.The one-day (cash/tomorrow) dollar/rupee swap rate rose to 1.21 paisa, from 0.40-0.46 paisa on Monday. The implied rupee interest rate based on the swap was around 9%, well above the 5.60% call rate.\"This is the typical pattern we've seen over the last few quarters,\" said a FX swap trader at a mid-sized private bank. \"Banks are simply parking the excess dollars on hand.\"Explaining why this happens on the last day of the quarter, he said that banks can place dollar deposits for their excess dollars on other days. However, deposit limits apply on the last day of a quarter.He pointed out that the situation was particularly severe in December last year, when the one-day swap climbed well above 10 paisa.Meanwhile, the dollar/rupee spot rate was at 88.76, unchanged from Monday. The pair dipped slightly at the open before encountering dollar buying from jewellery companies and other regular importers, bankers said.The rupee remains just shy of last week's all-time low of 88.7975.\"With no further news on the India-US trade, markets are awaiting the RBI policy tomorrow to gauge what it has in mind on the rupee and on the interest rate front,\" Anil Bhansali, head of treasury at Finrex Treasury Advisors , said.On Wednesday, the Reserve Bank of India will decide on whether to cut the key policy rate in the wake of U.S.-India trade tensions or keep it on hold to observe the impact of the Goods and Services Tax cuts.",
    "category": "economics"
  },
  {
    "title": "Likely to see calibrated Rupee weakness in Real terms if no respite on trade front",
    "url": "https://economictimes.indiatimes.com/markets/forex/forex-news/likely-to-see-calibrated-rupee-weakness-in-real-terms-if-no-respite-on-trade-front/articleshow/124227808.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 12:04:53 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nWhile the Rupee has weakened 2.9% against the Dollar YTD in 2025, the depreciation against other major currencies has been far more pronounced. The Rupee has fallen 16% against the Euro , 11% against the Pound , and 6% against the Chinese Yuan — significant moves by any measure. On a trade-weighted basis, Rupee overvaluation against a basket of currencies has corrected by nearly 8%.Historically, periods of Rupee weakness have coincided with sharp spikes in volatility. The spot-vol correlation in USDINR has typically been positive, meaning that as the spot moves higher, volatility rises. This is natural since most participants are short USDINR for carry.What is unusual this time is that despite the Rupee hitting an all-time low, volatility has remained muted. Three-month at-the-money vols have barely held above 5% and have now eased to 3.5%. Similarly, three-month 25 Delta risk reversals — which reflect the difference between implied volatility of calls and puts — usually spike during bouts of Rupee depreciation.Calls, which serve as insurance against further Rupee weakness, generally become expensive relative to puts. Yet, these too are exceptionally low, hovering near zero.This suggests there is no panic in the market. Participants appear to view the Rupee’s move as controlled, possibly even intentional. Instead of weakening sharply against the Dollar and other currencies, the Rupee has largely been prevented from strengthening amid broad-based Dollar weakness.Supporting this perception are benign macro fundamentals. With Brent crude below USD 70 per barrel, India’s Current Account Deficit (CAD) remains contained. RBI ’s FX reserves , buoyed in part by valuation effects, are back above USD 700 billion. Together, stable CAD and a healthy reserve cushion provide comfort.There is also a sense that keeping the Rupee relatively weak complements monetary easing and liquidity infusion to support growth. Going forward, the pace of depreciation is likely to slow. However, if tariff pressures persist, engineering gradual Rupee weakness may be used as a policy lever to bridge the competitiveness gap with peers.Any such move, however, is expected to be controlled, calibrated, and non-disruptive — more of a staircase-like adjustment than a one-way slide.(The author, Abhishek Goenka is Founder and CEO IFA Global): Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
    "category": "economics"
  },
  {
    "title": "Advance Agrolife IPO Day 1: GMP at 10%, issue subscribed 9% so far.  Should you bid?",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/advance-agrolife-ipo-day-1-gmp-at-10-issue-subscribed-9-so-far-should-you-bid/articleshow/124227602.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 11:56:04 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe Rs 193 crore initial public offering (IPO) of Advance Agrolife got off to a decent start on Day 1 on Tuesday, September 30. The IPO was booked at 9%, with bids for 11.83 lakh shares against the total offer size of 1.35 crore shares. In the grey market, the IPO is currently trading at a premium of around 10% over its issue price, indicating early investor interest and a possible listing near Rs 110 per share.The Advance Agrolife IPO consists entirely of a fresh issue of 1.93 crore equity shares, offered at a price band of Rs 95 and Rs 100 apiece. The offer will remain open for subscription until October 3.The Advance Agrolife IPO was subscribed 9% overall by 10:50 AM on Day 1.Retail Individual Investors (RIIs): Subscribed 16% of the 67.39 lakh shares on offer for them.Non-Institutional Investors (NIIs): Subscribed 5% of the 28.88 lakh shares available.Qualified Institutional Buyers (QIBs): No bids received for the 38.51 lakh shares allocated.Shares of Advance Agrolife are trading at a 10% premium in the grey market over their issue price of Rs 100. This indicates a grey market premium (GMP) of Rs 10–11, suggesting a likely listing price around Rs 110–111 if current trends continue.This early demand in the unofficial market reflects moderate investor interest ahead of the stock’s official listing.Jaipur-based agrochemical company Advance Agrolife is launching an IPO consisting entirely of a fresh issue of 1.93 crore equity shares, with a price band set at Rs 95–Rs 100 per share.The IPO closes on October 3, and the company’s shares are expected to be listed on the BSE and NSE on October 8.The Advance Agrolife IPO allocation is structured with up to 50% reserved for Qualified Institutional Buyers (QIBs), at least 35% set aside for Retail Individual Investors (RIIs), and 15% allocated to Non-Institutional Investors (NIIs). For retail investors, the minimum application size is one lot comprising 150 shares, which requires an investment of Rs 15,000 at the upper end of the price band.Advance Agrolife, established in 2002, is engaged in the manufacturing of a wide range of agrochemical products. Its portfolio includes insecticides, herbicides, fungicides, plant growth regulators, as well as micronutrients and bio-fertilisers.The company also produces technical-grade active ingredients used in agrochemical formulations, catering to the entire crop lifecycle during both Kharif and Rabi seasons.Advance Agrolife has a strong domestic footprint, serving farmers across 19 Indian states and 3 union territories. It also exports to international markets, including the UAE, Bangladesh, Turkey, Egypt, and Nepal.In FY25, Advance Agrolife reported a revenue of Rs 502.88 crore, marking a 10% year-on-year growth. The company’s profit after tax also saw an improvement, rising 4% YoY to Rs 25.64 crore, reflecting steady financial performance amidst sectoral challenges.Proceeds from the IPO will primarily be used to meet working capital requirements (estimated at Rs 135 crore) of Advance Agrolife. The remaining funds will be allocated toward general corporate purposes.Brokerages note that the IPO is priced at reasonable valuations relative to listed peers in the agrochemical sector. However, they caution that the industry remains sensitive to monsoon patterns and global commodity price fluctuations, which can impact performance.Choice Capital Advisors is the book-running lead manager, and Kfintech Technologies is the registrar of the offer.Also read: 10 SME IPOs have opened for subscription. All you need to know before bidding Advance Agrolife - At the upper price band of ₹100, the IPO is valued at a P/E multiple of 25.1x and an EV/EBITDA multiple of 15.1x based on post-issue capital. Between FY23 and FY25, Advance Agrolife reported a CAGR of 12.4% in revenue, 37.9% in EBITDA, and 31.3% in profit after tax (PAT).According to SBI Securities, they maintain a 'Neutral' view on the IPO, opting to monitor the company’s post-listing performance in comparison with its major listed peers.(Disclaimer: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of the Economic Times)",
    "category": "economics"
  },
  {
    "title": "Kuwait begins three-part bond offering, IFR reports",
    "url": "https://economictimes.indiatimes.com/markets/bonds/kuwait-begins-three-part-bond-offering-ifr-reports/articleshow/124227460.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 11:47:38 +0530",
    "text": "as a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nKuwait has started accepting bids for a three-part U.S. dollar denominated bond offering with 3-year, 5-year and 10-year maturities, fixed income news service IFR reported on Tuesday.The indicative price for the 3-year portion has been set at 70 basis points over U.S. Treasuries, the 5-year at 75 bps over the same benchmark, while the 10-year part carries an initial price guidance of 85 bps, IFR said. JPMorgan and Mizuho are acting as joint global coordinators, lead managers and bookrunners for the debt deal, IFR added.The benchmark-sized senior unsecured bonds are being issued under the State of Kuwait's Global Medium Term Note Programme , the report said. Benchmark size is typically at least $500 million.",
    "category": "economics"
  },
  {
    "title": "US govt shutdown is \"noise\" investors should focus on fundamentals: Matt Orton",
    "url": "https://economictimes.indiatimes.com/markets/expert-view/us-govt-shutdown-is-noise-investors-should-focus-on-fundamentals-matt-orton/articleshow/124227123.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 11:34:20 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nNew Delhi: With Washington once again grappling with the threat of a government shutdown investors worldwide are bracing for potential market tremors. But according to Matt Orton , Chief Market Strategist at Raymond James Investment Management, the impact on asset classes may be far less severe than feared.Speaking to ET Now, Orton dismissed the looming shutdown as largely inconsequential to market direction. “The shutdown of the US government is not that surprising. Markets have largely been positioned for continued dysfunction at least in the legislative branch of the US government. So, I do not think that much changes,” he said.Drawing parallels with history, Orton pointed out that past shutdowns have not led to major sell-offs. “In fact, in 2018 and into 2019, the market had double-digit gains between the start of the government shutdown and the end of the shutdown. I would say the most similar period to this is back in 2013... the max draw down of the market was 2.5%. So, it is not that big of a deal. It is more noise. And I encourage investors to fade the noise and really focus on the fundamentals .”He added that the fundamentals currently look promising. “We are likely going to continue the easing cycle of interest rates in the US into a backdrop of rising earnings, this rarely happens historically speaking and it is a very-very good environment to be risk in the market and continue to invest in a lot of the durable growth themes that have been working. So, I remain bullish on US equity markets ,” he said, while also highlighting opportunities in gold and emerging markets.Asked about risks to this bullish outlook, Orton noted that tariffs are often overstated. “Tariffs are probably the red herring in the situation. It is not to downplay the risk that tariffs could have with the slower feed through to inflationary pressures, but the bigger challenge for the inflation numbers that we have been seeing coming through is actually services inflation, not core goods inflation,” he explained.He underlined wage pressures and immigration policy as more significant drivers of sticky inflation. The greater risk, he said, lies in a surprisingly strong jobs report. “The biggest risk is if we do get non-farm payrolls on Friday, that there is a blockbuster print, say a print of a 100,000 jobs or more, I think that will cause more significant repricing in the market, that would cause an appreciation of the US dollar and so that bears a larger risk if that does play out.”Even so, Orton sees such setbacks as temporary. “This is why I encourage investors number one to be balanced, not only across sectors and industries in the US, but across geographies... you can get in at a cheaper price if you are lacking exposure to say some of the AI beneficiaries or financials which will continue to do well on M&A not so much just the rate theme.”The conversation also turned to stretched valuations, with US market cap-to-GDP now exceeding 200%. Does this signal a bubble? Orton was clear in his response: “Absolutely not. I do not think there is a bubble on artificial intelligence and it is really for three key reasons.”First, he cited the strength of earnings across both megacap tech and the broader market. Second, he dismissed the idea of debt-driven excesses: “In order for you to have a bubble, you have to have a debt fuelled cycle... and that is absolutely not the case of what is happening today.”Third, he noted that sentiment remains far from euphoric. “There is still, believe it or not, a lot of scepticism out there and a lot of investors who are not fully invested in this trade, especially at the institutional level... So, I still think there is a lot of tailwinds going forward and a broadening that is likely to play out.”While headlines around shutdowns, tariffs, and stretched valuations may stoke anxiety, Orton urges investors to stay grounded. His message is simple: focus on fundamentals, remain balanced, and look beyond the noise.",
    "category": "economics"
  },
  {
    "title": "Hindustan Zinc’s exposure to silver is underpriced, calls for re-rating, says Emkay Global",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/hindustan-zincs-exposure-to-silver-is-underpriced-calls-for-re-rating-says-emkay-global/articleshow/124227003.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 11:31:21 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nShares of Hindustan Zinc (HZ) could likely benefit from Silver’s remarkable rally and is emerging as one of the biggest beneficiaries as prices of the precious metal continue to surge, up 63% so far this year to $47 per ounce — sharply higher than $34/oz in Q1FY26 and $30/oz in FY25, Emkay Global said in a note dated September 29.Analysts believe the market is yet to fully price in the company’s exposure to silver, even as global peers such as Fresnillo and Grupo Mexico have already re-rated in 2025. With consensus expectations still trailing the rally, they see significant room for Hindustan Zinc’s valuation to catch up — a rating that would directly benefit parent Vedanta Ltd (VEDL), where the company accounts for 40% of consolidated EBITDA. Nifty gets fresh look with 2 new stocks; Hero MotoCorp, IndusInd Bank drop out “Interestingly, silver is a by-product of zinc, which implies that 88% of silver revenue is a direct pass-through to EBITDA as the cost of production remains tied to zinc production. We retain BUY on VEDL, with a price target of Rs 525 per share,” the brokerage added. The forecast implies an upside potential of 22% from the last close.HZ posted EBITDA of Rs 17,400 crore in FY25 with a margin of 53%. If spot prices of zinc and silver hold, the brokerage expects EBITDA to climb to Rs 22,000 crore with a 57% margin by FY27.Globally, HZ is among the top silver producers, mining 22.5 million ounces annually — ahead of Grupo Mexico (12.1Moz) and not far behind leaders like Fresnillo (52.5Moz) and Newmont (28Moz). It operates in the first quartile of the global zinc cost curve with a 25-year mine life.HZ also ranks number 1 globally in the S&P corporate sustainability assessment for metals and mining and is stepping up its energy transition plans, targeting a rise in renewable power use from 13% currently to 70% by FY28.At about 10:30 am, shares of Hindustan Zinc were trading at their day’s high of Rs 480, higher by 3% from the last close on the NSE. The stock is up 8% on a year-to-date basis. Vedanta shares also traded at their day’s high of Rs 462, up 2.3%. The stock is up over 7% in the last 1 month.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
    "category": "economics"
  },
  {
    "title": "Tata Motors demerger effective from tomorrow. What is known so far on record date, listing timeline",
    "url": "https://economictimes.indiatimes.com/markets/stocks/news/tata-motors-demerger-effective-from-tomorrow-what-is-known-so-far-on-record-date-listing-timeline/articleshow/124226946.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 11:24:25 +0530",
    "text": "Live Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nFollowing all regulatory approvals, the much-awaited demerger of Tata Motors ' passenger vehicle (PV) and commercial vehicle (CV) businesses comes into effect from October 1. The JLR-maker has told analysts that the record date for demerger would tentatively be in mid-October, followed by the listing of both businesses by November.Last week, the National Company Law Tribunal (NCLT) had cleared the composite scheme of arrangement under which Tata Motors' CV business will be spun off into TML Commercial Vehicles Ltd (TMLCV) while the PV business will be consolidated under Tata Motors, which will be renamed Tata Motors Passenger Vehicles Ltd.Under the demerger, shareholders will get one share of TMLCV for every share held in Tata Motors. The scheme also provides for the transfer of non-convertible debentures worth Rs 2,300 crore to the CV entity.Tata Motors said the move will unlock value and give both businesses a sharper strategic focus, improved agility, and clearer capital allocation.\"The demerger of the commercial vehicle (CV) business is on track, and NCLT approval has been received. The effective date is 1 Oct and the record date is tentatively in mid-Oct, subject to final approval from the Registrar of Companies. The stock will trade ex-CVs on the day after the record date and will subsequently be renamed Tata Motors Passenger Vehicles Limited (TMPVL),\" Jefferies said in a note after meeting Tata Motors management.After the completion of all formalities, the CV business will tentatively be listed in November as TMLCV, subject to the completion of all pending formalities. Tata Motors shares have been under pressure and lost around 32% of their value in the last year as JLR demand outlook stays challenging in the near-term for Europe, China and the US regions.\"We are positive on India PV demand, but we see challenges for JLR, including increased competition & consumption tax in China, higher warranty costs, and the BEV transition. Moreover, its key models (RR, RR Sport, and Defender) are now 2-4 years old. We are also less convinced on PV margin improvement and the Iveco acquisition,\" Jefferies said, while giving an underperform call on the stock with a target price of Rs 575.The company has told analysts that, following the post-production shutdown from a cyber-attack this month, JLR will resume manufacturing in a controlled and phased manner in the coming days.\"Nonetheless, JLR is facing several headwinds, which include tariff-led slowdown for exports to the US, demand weakness in key regions like Europe and China, and rising VME, warranty and emission costs,\" Motilal Oswal said while giving a neutral call on the stock with a target price of Rs 686.Led by muted growth prospects in JLR, Nuvama has also retained a reduce call on the stock with a target price of Rs 680.: Recommendations, suggestions, views and opinions given by the experts are their own. These do not represent the views of The Economic Times)",
    "category": "economics"
  },
  {
    "title": "Bitcoin bounces back at $114K, Ethereum trades at $4,204; gold rally boosts market sentiment",
    "url": "https://economictimes.indiatimes.com/markets/cryptocurrency/crypto-news/bitcoin-bounces-back-at-114k-ethereum-trades-at-4204-gold-rally-boosts-market-sentiment/articleshow/124226540.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 11:01:57 +0530",
    "text": "Crypto Tracker TOP COINS (₹) Bitcoin 10,112,513 ( 1.99% ) Ethereum 371,417 ( 1.9% ) XRP 257 ( 1.48% ) BNB 90,861 ( 1.34% ) Tether 89 ( 0.06% )\n\nLive Events\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nMajor cryptocurrencies gained on Tuesday, buoyed by positive market sentiment after gold’s record rally. Bitcoin jumped over 2% over the past 24 hours to $114,421, while Ethereum rose nearly 2% to $4,203.“Bitcoin continued its upward momentum, trading over $114,800 as market sentiment improved with gold hitting new all-time highs. Historically, Bitcoin has followed gold’s trajectory as both assets are seen as safe havens. At the same time, whales continue to support the price action with transfers of over 3900 BTC in a day, suggesting potential big moves ahead,” said Edul Patel, CEO of Mudrex.“Meanwhile, Ethereum is also gaining momentum, trading above $4,200. If bulls manage to hold above this level, the market could see a strong surge in the coming days, setting the stage for Ethereum to retest higher levels,” Patel added.At 9:34 AM IST, Bitcoin was trading at $114,431, up by 2.29% over the past 24 hours and by nearly 1.71% over the past week. Ethereum, meanwhile, was at $4,201, gaining 1.96% in the past 24 hours and 0.17% over the last seven days.According to CoinMarketCap data, the crypto sector’s overall market capitalisation stood at around $3.92 trillion on Tuesday.According to another expert, BTC trading at $114K shows resilience amid macro uncertainty and regulatory shifts.“Institutional interest, especially via ETFs, is driving long-term optimism, while supply constraints post-halving strengthen bullish narratives. Technically, BTC faces resistance near $120,000, with support at $111,000. A breakout above resistance could open paths toward $140,000+, while downside risks remain if macro or regulatory headwinds intensify,” said Sathvik Vishwanath, Co-Founder & CEO, Unocoin.“Volatility is amplified by leveraged futures activity, making short-term moves sharp and unpredictable. Despite risks, Bitcoin remains a key risk-on asset and a store-of-value hedge, increasingly influenced by global economic dynamics, investor sentiment, and evolving adoption trends in both retail and institutional circles,” the expert from Unocoin added.",
    "category": "economics"
  },
  {
    "title": "Fabtech Technologies IPO, OM Freight Forwarders IPO Day 2 updates: Check GMPs, subscription, and key highlights",
    "url": "https://economictimes.indiatimes.com/markets/ipos/fpos/fabtech-technologies-ipo-om-freight-forwarders-ipo-day-2-updates-check-gmps-subscription-and-key-highlights/articleshow/124226242.cms",
    "source": "",
    "published": "Tue, 30 Sep 2025 10:45:22 +0530",
    "text": "Fabtech Technologies IPO Details\n\n\n\nLive Events\n\nOm Freight Forwarders IPO Details\n\n\n\nas a Reliable and Trusted News Source Addas a Reliable and Trusted News Source Add Now!\n\n\n\n\n\n(You can now subscribe to our\n\n(You can now subscribe to our ETMarkets WhatsApp channel\n\nThe initial public offerings of both Fabtech Technologies and OM Freight Forwarders entered the second day of bidding on Tuesday. On Day 1, Fabtech Technologies IPO saw a subscription rate of 70% whereas OM Freight Forwarders' IPO was fully subscribed. Investors bid for 1.39 times the shares on offer in OM Freight Forwarders IPO Looking at the Grey Market Premium (GMP), which indicates how the IPO shares are trading unofficially before they list on the stock exchange, Fabtech Technologies is trading at a premium of 1% over its issue price of Rs 191, hinting at modest market interest. Meanwhile, OM Freight Forwarders was seen trading at a higher 5.93% premium, reflecting stronger demand and positive sentiment among investors.Subscription Status: On Day 1, Fabtech Technologies’ IPO was 70% subscribed overall. Retail investors (RIIs) took up 71% of their allotted 42 lakh shares, and non-institutional investors (NIIs) bid for 46% of 18 lakh shares assigned to them. Qualified institutional buyers (QIBs) subscribed their portion of 60 lakh shares 77%. QIB participation usually increases in the following days.Grey Market Premium (GMP): The GMP for Fabtech Technologies IPO has fallen sharply from about 18% at its peak to around 1% on Tuesday. This suggests that the shares are expected to list close to the upper end of the price band, approximately Rs 193 per share.Key IPO Details: Fabtech Technologies is raising Rs 230 crore through this IPO, which consists entirely of a fresh issue of approximately 1.21 crore equity shares. The price band is fixed between Rs 181 and Rs 191 per share. For retail investors, the minimum application size is 75 shares.The Fabtech Technologies IPO opened on September 29 and will close on October 1. The basis of allotment in the offer is expected to be finalised by October 3, with shares likely to start trading on the NSE and BSE from October 7, subject to regulatory approvals.Use of IPO Proceeds: The company plans to deploy the funds raised to support its business needs. This includes Rs 1,270 crore for working capital, Rs 300 crore earmarked for acquisitions to accelerate growth, and the remainder for general corporate purposes and strategic flexibility.Subscription Status: On Day 1, the Om Freight Forwarders IPO was oversubscribed by 1.39 times overall. Retail investors subscribed to 54% of the 43.60 lakh shares allocated to them. NIIs showed strong enthusiasm, bidding 4.03 times for their 17.64 lakh shares. QIBs also participated actively, subscribing to 1.10 times the 13.41 lakh shares allocated to them.Grey Market Premium (GMP): The GMP for Om Freight Forwarders stands at a 5.93% premium over its issue price of Rs 135, indicating a probable listing price near Rs 144.10 SME IPOs have opened for subscription. All you need to know before biddingIPO Timeline and Structure: The IPO includes a fresh issue worth Rs 24.44 crore and an offer for sale (OFS) by existing shareholders totalling Rs 97.88 crore. The subscription period runs from September 29 to October 3. The allotment is expected on October 6, with the shares likely to begin trading on the NSE and BSE on October 8.Use of Funds: Funds raised through the fresh issue will primarily be used to purchase commercial vehicles and heavy equipment, amounting to Rs 17.15 crore. The rest of the proceeds will be used for general corporate purposes.",
    "category": "economics"
  },
  {
    "title": "'Need leapfrogging to win wars': Air Marshal pushes for self-reliance in defence; calls progress 'painfully slow'",
    "url": "https://timesofindia.indiatimes.com/india/need-leapfrogging-to-win-wars-air-marshal-pushes-for-self-reliance-in-defence-calls-progress-painfully-slow/articleshow/124228542.cms",
    "source": "",
    "published": "2025-09-30T13:32:27+05:30",
    "text": "Air Marshal\n\nIndia and Morocco Sign Defence MoU to Boost Counter-Terrorism, Maritime Security\n\nNEW DELHI: Deputy Chief of Air Staff Air Marshal Awadhesh Kumar Bharti on Tuesday said India urgently needs faster indigenisation in the defence sector.He also warned that progress from concept to operationalisation is \"painfully slow\" and said the nation should focus more on producing equipment, technology, and products domestically rather than relying on imports.Speaking at the Aero Tech India 2025 event in New Delhi, he said India must achieve “leapfrogging” in critical technologies to secure strategic autonomy. “To win future wars, there is no doubt that indigenisation is the way ahead. Our global partners may not always be able to share niche and critical technology with us. What we need is leapfrogging, which largely will have to be done on our own,” he said.Air Marshal Bharti said India requires advanced capabilities in areas like secure chips, communication systems, hypersonics, aircraft, and space assets. He stressed that research and development should be accelerated to quickly convert ideas into deployed technology. “Indigenisation is the key to our future capabilities; considerable work is going on, there is no doubt. However, the progress from conceptualisation to operationalisation is painfully slow, and that is our pain point. And to be able to achieve this accelerated pace of innovation in the country, research and development, environment and infrastructure have to see a revolution,” he said.He also explained that the nature of warfare is changing, ranging from low-cost unmanned systems to advanced high-tech platforms powered by artificial intelligence.“Once the kinetic action starts, future conflicts will be fought at the entire end of the spectrum. And when I say entire end of the spectrum, it is not only that they will be high tech, tanks, aircraft or ships. It will be fought even at the lower end with low-tech, low-capital solutions. So at one extreme would be low-cost mass saturation, characterised by usage of drones and other unmanned systems. The other extreme would be high-cost equipment, niche technologies, precise with a large weight of attack, characterised by the usage of sixth-generation technologies. Future warfare will be about collaboration between humans and machines, robots and autonomous systems integrated with AI would be fighting side by side with humans,” the Air Marshal said.Air Vice Marshal Anil Golani praised the Indian Air Force’s role in Operation Sindoor and highlighted the need for innovation in next-generation missiles and combat aircraft. He said the Tejas programme alone is expected to create around 12,000 jobs each year for the next six years with support from 115 suppliers, and predicted that MSMEs in the defence sector could grow to 16,000 by 2030.",
    "category": "politics"
  },
  {
    "title": "National Hunter Alliance Summit 2025 highlights urgent gaps in rare disease policy and patient care",
    "url": "https://timesofindia.indiatimes.com/india/national-hunter-alliance-summit-2025-highlights-urgent-gaps-in-rare-disease-policy-and-patient-care/articleshow/124228630.cms",
    "source": "",
    "published": "2025-09-30T12:46:31+05:30",
    "text": "NEW DELHI: The National Hunter Alliance Summit 2025, held on 27th September'2025 in New Delhi, brought together patients, caregivers, medical experts, policymakers, and advocates to address the urgent and ongoing challenges faced by individuals affected by Hunter Syndrome (MPS II) and other Rare Diseases.The program began with an emotional tribute to the Hunter Syndrome warriors who lost their lives to this devastating disease. Their memory served as a reminder of the pressing need for action and accountability in India's rare disease ecosystem.Prof. (Dr.) Shefali Gulati, at AIIMS, New Delhi also member of the Central Technical Committee for Rare Diseases (CTCRD), emphasized the need for a coordinated, collaborative approach among stakeholders and unified advocacy to enhance rare disease management, policy execution, and patient care.Mr. Saurabh Singh, Co-founder & Director of Rare Diseases India Foundation (RDIF), delivered a strong presentation on the systemic gaps in the implementation of the National Rare Disease Policy 2021 (NRDP). While Hunter Syndrome is already recognized under the policy, he highlighted that: The Rs. 50 lakh financial assistance under NRDP remains inaccessible and ineffective, as treatment costs run into crores.Patients are denied support even in emergencies at private hospitals.Ayushman Bharat Yojna benefits are restricted only to BPL families, excluding a large patient population.No caregiver support is available, despite families bearing heavy monthly expenses and emotional burdens, No Insurance companies cover Rare Diseases.No meaningful research is being conducted in India to reduce the cost of life-saving therapies.Judicial delays further deny children their fundamental right to life under Article 21 of the Constitution.He also drew attention to serious issues faced by dependents of Defence personnel and CGHS beneficiaries, where bureaucratic delays in drug procurement cause treatment gaps of 3-6 months, severely impacting patient health. Despite funding releases, lethargy in the system continues to risk lives.Comparing the rapid development of the COVID-19 vaccine to a decade of inaction on rare diseases, he stressed: \"If India could research and deliver a COVID vaccine in months, why has no progress been made in rare diseases over the last 12 years?\" In a deeply moving moment, Mr. Saurabh Singh shared his personal loss-just last month, on 20th August 2025, he lost his 13 years old beloved son Shaurya to Hunter Syndrome. Yet, standing firm only weeks later, he declared: \"My fight will continue until medicines become affordable or free for every rare disease patient in this country. My continued work for this cause will be my eternal tribute to Shaurya.\" His courage and determination drew heartfelt admiration from all present, symbolizing the unconditional love of a parent and the collective pain of hundreds of families fighting similar battles.The summit also heard an emotional account from Ex-Serviceman HAV. D.K. Chansolia, who shared the struggles of procuring life-saving drugs for his son within the Defence system. He highlighted that challenges such as procedural delays and shortage of specialized experts often cause treatment gaps. 'As someone who served the nation, I had faith that my family's healthcare needs would be supported. Today, I feel disheartened,' he shared.The summit ended with a united appeal to the Government and Hon'ble Supreme Court to urgently address these gaps and save the lives of rare disease patients.",
    "category": "politics"
  },
  {
    "title": "RSS centenary celebrations: PM Modi to attend Delhi event on October 1; stamp & coin to be released",
    "url": "https://timesofindia.indiatimes.com/india/rss-centenary-celebrations-pm-modi-to-attend-delhi-event-on-october-1-stamp-coin-to-be-released/articleshow/124227261.cms",
    "source": "",
    "published": "2025-09-30T11:44:38+05:30",
    "text": "PM Modi's RSS Praise In Independence Day Speech Draws Congress Ire, Triggers Retirement Jibe\n\nNEW DELHI: Prime Minister Narendra Modi will participate as the chief guest in the centenary celebrations of the Rashtriya Swayamsevak Sangh RSS ) on October 1 (Wednesday) at Dr Ambedkar International Centre, New Delhi. The event will begin at 10:30 am.On the occasion, the Prime Minister will release a specially designed commemorative postage stamp and coin, marking the RSS’ century-long contributions to the nation. He will also address the gathering of dignitaries, volunteers, and members of the Sangh.Founded in 1925 in Nagpur, Maharashtra, by Keshav Baliram Hedgewar, the RSS was established as a volunteer-based organisation aimed at fostering cultural awareness, discipline, service, and social responsibility among citizens. Over the decades, it has grown into a people-driven movement for national reconstruction, with its vision rooted in Dharma and patriotism.The organisation’s stated goal is the “Sarvangeena Unnati” or all-round development of India, to which every Swayamsevak dedicates himself.The centenary celebrations aim to honour the historical achievements of the RSS while highlighting its contributions to India’s cultural journey and its message of national unity.The event will feature cultural programmes, speeches, and exhibitions reflecting the Sangh’s legacy and its ongoing work across the country.The RSS, which began as a small volunteer organisation, has expanded over the century to become a nationwide movement, influencing education, social work, and community development. Its focus on discipline, service, and national pride continues to guide its activities and volunteer initiatives across India.",
    "category": "politics"
  },
  {
    "title": "'India will not be deterred': CDS General rejects nuclear blackmail; calls for bio-threat preparedness post Op Sindoor",
    "url": "https://timesofindia.indiatimes.com/india/india-will-not-be-deterred-cds-general-rejects-nuclear-blackmail-calls-for-bio-threat-preparedness-post-op-sindoor/articleshow/124226704.cms",
    "source": "",
    "published": "2025-09-30T11:38:05+05:30",
    "text": "(CDS) General Anil Chauhan\n\nAlso read:\n\nJawaharlal Nehru’s Forward Policy Flawed: CDS Chauhan Says Air Force Snub Cost Us 1962 China War\n\nMilitary Nursing Service: 100 glorious years of selfless service\n\nNEW DELHI: Chief of defence staff (CDS) general Anil Chauhan on Tuesday shed light on the need for India to be prepared against bio-threats and radiological contamination from nuclear weapons in the future.Speaking at the Scientific Session on the 100th Raising Day of the Military Nursing Service (MNS) at the Manekshaw Centre, Delhi Cantt., general Chauhan highlighted the growing risks in the post-Covid era.\"The world has been through a period of intense travels and tribulations during the Covid-19 pandemic. Bio-threats, man-made, accidental or natural, are likely to increase in future,\" he said. \"Defence against such threats and treatment of infected persons require different treatment protocols. We must be prepared for this in future.\"The general also reiterated Prime Minister Narendra Modi’s stance on nuclear threats and the importance of radiological preparedness. \"Post Operation Sindoor, our Prime Minister has said that India will not be deterred by nuclear blackmail. While the possibility of the use of nuclear weapons in our context is low, but it would be prudent to take this into our security calculus.Radiological contamination requires different protocols for treatment and must be part of our training,\" he said. \"Preparedness against nuclear threats contributes to a deterrence against its use. I think that's important.\"The CDS praised the role of the Military Nursing Service, marking its 100 years of service. \"Military Nursing Service has completed 100 glorious years of selfless service to the nation. Whether in the frontline of conflicts, makeshift hospitals, aboard ships on seas or humanitarian missions, your dedication has brought comfort to the wounded, solace to the distressed and hope to the hopeless,\" he said. He added, \"I firmly believe nurses are the heartbeat of healthcare, giving more than just care. They offer hope, comfort, and compassion when they are needed the most. We must also focus on those who heal, also need healing. Heartening to see that the scientific session is not only on critical expertise but also the emotional and psychological well-being of caregivers.\"Chauhan further highlighted the importance of jointness among the armed forces and the role of data security. \"Role-based access and encryption of medical data is very relevant in today's era of data-centric warfare where access to information will allow enemy or give him a bit of an advantage over us,\" he said.The Military Nursing Service was established in 1926 and remains a vital part of the Indian Armed Forces, contributing across conflicts, humanitarian missions, and medical operations.",
    "category": "politics"
  },
  {
    "title": "‘Mishandled due to foreign pressure’: BJP blasts Chidambaram over 26/11 retaliation remark; questions role of Sonia Gandhi",
    "url": "https://timesofindia.indiatimes.com/india/mishandled-due-to-foreign-pressure-bjp-blasts-chidambaram-over-26/11-retaliation-remark-questions-role-of-sonia-gandhi/articleshow/124226495.cms",
    "source": "",
    "published": "2025-09-30T11:03:39+05:30",
    "text": "P Chidambaram (left), Pralhad Joshi (ANI)\n\nPoll Should past decisions regarding military retaliation be re-evaluated? Yes, for better future strategies No, the past should remain unchanged\n\nWas in Mumbai During 26/11, Worked with ISI and Lashkar e Taiba: Tahawwur Rana's Shocking Confession\n\nNEW DELHI: The Bharatiya Janata Party launched a sharp attack on former Union home minister P Chidambaram over his recent remarks on the UPA government's decision not to retaliate militarily against Pakistan following the 26/11 Mumbai terror attacks, accusing the Congress of “mishandling” the situation under foreign pressure.Reacting to Chidambaram’s statements made during an interview, union minister Pralhad Joshi posted on X, “After 17 years, Chidambaram, former home minister, admits what the nation knew - 26/11 was mishandled due to pressure from foreign powers. Too little, too late.”In the interview, Chidambaram said that the idea of retaliation “did cross [his] mind”, but the government eventually decided against military action. He said this decision was influenced largely by the ministry of external affairs and senior diplomats.“The whole world descended upon Delhi to tell us 'don't start a war'. Condoleezza Rice, who was then US secretary of state, flew in two or three days after I took over… to say, 'please don't react',” he said.Chidambaram, who took over as home minister just days after the attack, also acknowledged that he discussed possible retributive steps with the then Prime Minister Manmohan Singh and other key figures.“The Prime Minister had discussed this even when the attack was going on... And the conclusion was, largely influenced by the ministry of external affairs and the IFS, that we should not physically react to the situation,” he recalled.The remarks have sparked a political row, with BJP spokesperson Shehzad Poonawalla questioning whether then Prime Minister Manmohan Singh or UPA chairperson Sonia Gandhi had overruled Chidambaram’s personal view in favour of retaliation.Posting on X, he wrote, “Why was UPA taking orders from [Condoleezza Rice]? Why did Sonia Gandhi prevail over the Home Minister?” he asked.Poonawalla further accused the Congress of giving Pakistan a “clean chit” not only on the 26/11 attacks but also in the 2007 Samjhauta Express bombing case. He alleged that the UPA government advanced a “Hindu terror” narrative and granted Pakistan ‘most favoured nation’ (MFN) status despite repeated cross-border terror incidents.He added, “Congress gave clean chit to Pak on 26/11 and Samjhauta & induced Hindu Terror angles. Today too they doubt Surgical Strike, Balakote and Operation Sindoor.”On November 26, 2008, ten heavily armed Pakistani terrorists carried out coordinated attacks across Mumbai, killing over 166 people and injuring hundreds. One attacker, Ajmal Kasab, was captured alive and later executed in 2012.",
    "category": "politics"
  },
  {
    "title": "‘Pro red-terror’: BJP slams Congress, CPI over 'naxal mukt Bharat' questions; calls them ‘tudke tudke gang’",
    "url": "https://timesofindia.indiatimes.com/india/pro-red-terror-bjp-slams-congress-cpi-over-naxal-mukt-bharat-questions-calls-them-tudke-tudke-gang/articleshow/124224866.cms",
    "source": "",
    "published": "2025-09-30T09:40:33+05:30",
    "text": "D Raja (left), Pradeep Bhandari (ANI)\n\n‘Country will be free of Naxalism by 2026,’ Amit Shah, calls on Maoists to give up arms\n\nPoll Should the government prioritize economic development in anti-Naxal areas? Yes, it could reduce violence No, security should come first\n\nNEW DELHI: The Bhartiya Janta Party on Tuesday aunched a scathing attack on \"Congress and its allies,\" accusing them of backing Maoist violence.The reaction came as CPI general secretary D Raja on Monday questioned the government's push for a \"Naxal mukt Bharat\" and urged it to accept the proposal made by Naxal groups for talks.While addressing an event in Delhi, Raja questioned the intent behind anti-naxal operations, alluding it was bound to fail according to him as was BJP’s said agenda of “Congress mukt Bharat”.He said, “What is this Naxal Mukt Bharat? Already, they spoke about the Congress Mukt Bharat. What happened to Congress Mukt Bharat? Tomorrow they will say Communist Mukt Bharat,” Raja said during a press conference, as per news agency ANI.The CPI veteran added, “If the BJP and RSS, combined, continue to be in power, the future of India will be imperial. If we want to save India, save the constitution, we should remove the BJP RSS from power.”The remarks come in the backdrop of the ongoing anti-Naxal operation, dubbed Operation Black Forest, under which the number of most-affected Naxal districts has reportedly come down to six.Reacting to Raja’s statement, BJP spokesperson Pradeep Bhandari accused the Congress and CPI of “supporting violent Naxals and Maoists,” and “opposing India’s fight against Red Terror.”In a post on X, Bhandari wrote, “What is this Naxal Mukt Bharat’ says CPI Gen Secretary D Raja! Rahul Gandhi's alliance partner CPI gives support to violent Naxals and Maoists! Congress CPI opposes India's fight against Red Terror.”He further alleged that the CPI and Congress are “Pro Naxals, Pro Red Terror”, and accused them of compromising internal security and “ideologically patronising” left-wing extremism. “Congress CPI are ‘Political Tukde Tukde Gang’,” he wrote.The CPI is part of the INDIA alliance, which includes the Congress and other opposition parties gearing up for the upcoming assembly and general elections including Kerala where CPI shares power.",
    "category": "politics"
  },
  {
    "title": "US peace plan for Gaza: PM Modi welcomes Donald Trump's 20-point proposal; terms it 'viable pathway' to peace",
    "url": "https://timesofindia.indiatimes.com/india/us-peace-plan-for-gaza-pm-modi-welcomes-donald-trumps-20-point-proposal-terms-it-viable-pathway-to-peace/articleshow/124224719.cms",
    "source": "",
    "published": "2025-09-30T09:21:03+05:30",
    "text": "What if Hamas rejectes deal?\n\n\n\nNEW DELHI: Prime Minister Narendra Modi on Tuesday welcomed US President Donald Trump 's announcement of a comprehensive plan to end Gaza conflict.\"We welcome President Donald J Trump's announcement of a comprehensive plan to end the Gaza conflict. It provides a viable pathway to long-term and sustainable peace, security and development for the Palestinian and Israeli people, as also for the larger West Asian region,\" said PM Modi in a post on X.PM Modi expressed hope that \"all concerned will come together behind President Trump's initiative and support this effort to end conflict and secure peace.\"Trump and Israeli Prime Minister Benjamin Netanyahu announced on Monday that they have agreed on a plan to end the Gaza war, though it is unclear if Hamas will accept the terms.Also read: Who will govern Gaza? Donald Trump's 20-point peace plan — Explained The GOP leader’s plan on the Israel-Hamas war, which started on October 7, 2023, involves a 20-point peace proposal aimed at ending the conflict and preventing further escalation in the region. The plan calls for an immediate ceasefire, the release of hostages, and the protection of civilians on both sides. It also stresses the need for stronger regional cooperation and international monitoring to ensure compliance.Trump has argued that only a detailed, step-by-step framework can restore stability.Later, PM Modi posted his welcome of the comprehensive plan in Arabic and Hebrew as well.Hamas has yet to give its judgement on the 20-point plan. The plan calls for a ceasefire, the release of hostages by Hamas within 72 hours, the disarmament of Hamas, and a gradual Israeli withdrawal from Gaza, followed by a post-war transitional authority headed by Trump himself.\"I support your plan to end the war in Gaza which achieves our war aims,\" Netanyahu said during a joint press conference with US President. \"If Hamas rejects your plan, President, or if they supposedly accept it and then basically do everything to counter it, then Israel will finish the job by itself.\"Trump said that Israel would have his \"full backing\" if Hamas did not accept the deal. However, he insisted that peace in the Middle East was \"beyond very close\" and described the announcement of the plan as \"potentially one of the great days ever in civilisation.\"India was one of the first countries to recognise a Palestinian state in 1988 and also supported a two-state solution at the UN.Since the nearly three-year war, over 65,000 Palestinians have been killed, according to Gaza’s health ministry.",
    "category": "politics"
  },
  {
    "title": "Vijay Kumar Malhotra passes away: BJP veteran leader dies at 93; defeated Manmohan Singh in 1999",
    "url": "https://timesofindia.indiatimes.com/india/vijay-kumar-malhotra-passes-away-bjp-veteran-leader-dies-at-93-defeated-manmohan-singh-in-1999/articleshow/124223723.cms",
    "source": "",
    "published": "2025-09-30T07:59:17+05:30",
    "text": "Vijay Kumar Malhotra\n\nPoll Which aspect of Vijay Kumar Malhotra's leadership do you think had the most impact? Grassroots Connection Public Service Commitment\n\nNEW DELHI: Senior BJP leader and former MP Vijay Kumar Malhotra passed away at AIIMS New Delhi on Tuesday morning, said a statement from the hospital. He was 93.Malhotra, a five-time Member of Parliament and two-time MLA from Delhi, was among the most prominent faces of the BJP and its predecessor, the Jan Sangh, in the capital. He was also the president of the Delhi unit of the BJP.“Malhotra’s life was an example of simplicity and public service and he did much work for the expansion of Jan Sangh in Delhi,” the party said in the statement reported news agency PTI.PM Narendra Modi condoled Malhotra’s death, calling him a grassroots leader who remained committed to public service throughout his life. “He was a leader connected to the grassroots, with a deep understanding of the people's issues. He played a crucial role in strengthening the party in Delhi. He will always be remembered for his activism and contributions in Parliament,” the Prime Minister said. Extending his condolences to Malhotra’s family and well-wishers, he added, “Om Shanti. ”Incidentally, his demise came a day after PM inaugurated the Delhi BJP’s permanent office at DDU Marg, a development the party had awaited for years.A significant highlight of Malhotra’s political career was his 1999 Lok Sabha election victory, where he defeated former Prime Minister Manmohan Singh by a large margin. In the 2004 general elections, he was the only BJP candidate to win a parliamentary seat in Delhi, with the Congress sweeping the remaining six.Malhotra remained a key figure in Delhi politics for over four decades and played a major role in building the party's base in the city.",
    "category": "politics"
  },
  {
    "title": "Myanmar earthquake: North-East region hit with 4.7 magnitude quake; tremors felt across Assam, Manipur",
    "url": "https://timesofindia.indiatimes.com/india/myanmar-earthquake-north-east-region-hit-with-4-7-magnitude-quake-tremors-felt-across-assam-manipur/articleshow/124223517.cms",
    "source": "",
    "published": "2025-09-30T07:19:30+05:30",
    "text": "Representative image\n\nPoll Should seismology data be more accessible to the public? Yes No\n\nNEW DELHI: An earthquake of magnitude 4.7 struck Myanmar near the India border early Tuesday, with tremors felt in Manipur , Nagaland, and Assam.The quake occurred at 6.10am, about 27 km southeast of Ukhrul in Manipur, at a depth of 15 km. According to the national center for seismology (NCS), the epicentre was located at latitude 24.73 N and longitude 94.63 E. The location was around 155 km south-southeast of Nagaland’s Wokha, 159 km southeast of Dimapur, 177 km south of Mokokchung, 171 km northeast of Mizoram’s Ngopa, and 193 km northeast of Champhai.The tremor in Myanmar came hours after a magnitude 3.4 earthquake hit Maharashtra’s Satara district at 12.09am on Tuesday, at a shallow depth of 5 km, 91 km northwest of Kolhapur.Another quake of magnitude 3.3 was also recorded in Tibet at 4.28 am, with its epicentre 227 km north of Arunachal Pradesh’s Pangin and 303 km north of Assam’s Dibrugarh. Its depth was measured at 10 km, NCS data showed.",
    "category": "politics"
  },
  {
    "title": "Pak military neutralises TTP in Khyber to make way for LeT",
    "url": "https://timesofindia.indiatimes.com/india/pak-military-neutralises-ttp-in-khyber-to-make-way-for-let/articleshow/124223345.cms",
    "source": "",
    "published": "2025-09-30T06:44:09+05:30",
    "text": "Representative image\n\nIndia Calls Out Pakistan Twice at UNHRC Over Terror and Kashmir Lies, Khyber Pakhtunkhwa Bombing\n\nPoll Is the concept of 'good terrorism' vs 'bad terrorism' harmful for regional security? Yes, it undermines true peace efforts. No, it might be necessary for strategic plans.\n\nNEW DELHI: In order to smoothen Lashkar-e-Taiba operations and ensure uninterrupted training in a new terrain, the Pakistani military has launched a “clean-up drive” in Khyber Pakhtunkhwa Province to neutralise Tehreek-e-Taliban Pakistan TTP ) cadre in Lower Dir district.The clean-up drive, launched in June this year, has not only resulted in the death of over two dozen TTP operatives but also allowed the LeT to start constructing its new terror centre within a month of the operation. The recent aerial attack on an alleged TTP facility in Tirah Valley in KPK on Sept 22 was a part of this drive, an intelligence dossier has disclosed.Though Pakistan was the main patron of the Taliban — a militia of fundamentalists trained in Deobandi madrasas in Pakistan — and helped them fight and beat Russians, Americans as well as local ethnic groups like Tajiks and aided them install themselves in Kabul, the TTP has refused to be as pliant as ISI — Pakistan’s spy agency — expected it to. Its assertion of autonomy can potentially be problematic for ISI’s plans to find a new base for the LeT in KPK, considering that it is the homeground for Taliban.ISI has tried to recruit terrorists from the Lower Dir region for the jihad against India, Al Badr, but LeT and Hizbul Mujahideen had no presence there before Operation Sindoor in May. “Due to sectarian differences — TTP being Deobandi and anti-Pakistan and LeT following the Ahle Hadith ideology and being pro-Pakistan — there have been targeted killings of LeT commanders in Lower Dir by TTP operatives,” according to the dossier.In 2011, the LeT had tried to establish a temporary training centre in Lower Dir, but a suicide bomb attack carried out by TTP at the funeral of an LeT commander had led to the deaths of dozens of LeT members, a source said.Since June, the Pakistani army and air force have killed over 40 civilians in airstrikes, officially claiming these operations aimed at making Khyber Pakhtunkhwa “terror free”. “These operations are in reality focused on removing terrorists hostile to the Pakistani state while simultaneously facilitating the establishment of anti-India terror groups in the region, reflecting Pakistan’s longterm state strategy of endorsing ‘good terrorism’ while eliminating ‘bad terrorism’,” said a source.Lashkar, the sources said, has also been asked by Pakistani spy agency ISI to share training facilities with the Hizbul Mujahideen.“Operationally, the LeT’s new training centre expected to be completed by Dec 2025 poses a long-term threat. While still under construction, it is already emerging as a fresh hub for terrorist training,” the source added.",
    "category": "politics"
  },
  {
    "title": "Bishnoi gang a ‘terrorist entity’, accepts Canada; ‘terror tag’ shows Khalistanis' clout in Ottawa",
    "url": "https://timesofindia.indiatimes.com/india/bishnoi-gang-a-terrorist-entity-accepts-canada-terror-tag-shows-khalistanis-clout-in-ottawa/articleshow/124222839.cms",
    "source": "",
    "published": "2025-09-30T04:30:02+05:30",
    "text": "Lawrence Bishnoi (File photo)\n\nBishnoi ‘terror tag’ shows clout of Khalistani groups in Canada\n\n\n\nPoll Do you agree with Canada's decision to designate Lawrence Bishnoi's gang as a terrorist entity? Yes, it's a necessary measure. No, it's an overreach.\n\nNEW DELHI: Canada govt Monday listed Lawrence Bishnoi syndicate as a “terrorist entity”. The tag that follows Royal Canadian Mounted Police claims, not substantiated yet, that Bishnoi hired the killers of pro-Khalistan terrorist Hardeep Singh Nijjar allows Canadian cops to prosecute offences committed by the gang pertaining to financing, travel and recruitment. It means any assets owned by it in the country, like property, vehicles and money, can be frozen or seized.This comes at a time when the gang is facing a crackdown by Indian authorities, with several of its self-proclaimed members killed or injured in encounters.Canada’s ‘terrorist’ tag on the Bishnoi gang shows the clout of pro-Khalistani Sikh groups in the country who have blamed him for organising the killing of Nijjar and his associates allegedly at the instance of Indian agencies. The development comes on a day external affairs minister S Jaishankar held talks with his Canadian counterpart Anita Anand in New York. In 2023, former Canadian PM Justin Trudeau had claimed Canada had “credible evidence” of Indian agents’ role in Nijjar’s murder in British Columbia that June.It would now be an offence for anyone in Canada or Canadians abroad to knowingly deal with property owned or controlled by the Bishnoi group.“It is also an offence to directly or indirectly provide property knowing that it will be used by or benefit a terrorist group. Immigration and border officials can now inform decisions on admissibility to Canada under the Immigration and Refugee Protection Act,” a statement by govt said.It added that “the Bishnoi gang is a transnational criminal organisation operating primarily out of India. They have a presence in Canada and are active in areas with significant diaspora communities. The Bishnoi gang engages in murder, shootings and arson, and generates terror through extortion and intimidation.They create a climate of insecurity in these communities by targeting them, their prominent community members, businesses, and cultural figures.”This is the second instance after Dawood Ibrahim — the mastermind of the 1993 Mumbai serial blasts, enlisted by Pakistan to hurt India through narco-terrorism, who was designated a terrorist by the UN as well as the US — that an Indian criminal gang has been designated a terrorist entity by a foreign govt.Lawrence Bishnoi is currently lodged in the Sabarmati jail in Gujarat. His associates Goldy Brar and Rohit Godara are handling the operations of the gang and claim to be operating independently.The move is believed to have been mounted by three recent murders, sources said. On May 14, a businessman named Harjeet Dhadda was shot multiple times in a parking area in Mississauga, Ontario. A month later, a businessman in Surrey, British Columbia, and another in Brampton were shot dead, allegedly by Bishnoi and Brar gang’s shooters.",
    "category": "politics"
  },
  {
    "title": "Indian aid for Palestine close to record $80m in last 11 years: Govt",
    "url": "https://timesofindia.indiatimes.com/india/indian-aid-for-palestine-close-to-record-80m-in-last-11-years-govt/articleshow/124222832.cms",
    "source": "",
    "published": "2025-09-30T04:20:09+05:30",
    "text": "India has faced criticism for its flip-flop over the Gaza issue, like its decision to abstain from voting on a UNGA resolution for unconditional truce\n\nPoll Do you believe India's current level of assistance to Palestine is adequate? Yes, it meets their needs No, it should be higher\n\nNEW DELHI: India’s developmental assistance of close to $80 million for Palestine in the past 11 years is almost double that of the amount that was given in the preceding 65 years, according to Indian authorities. India has continued to extend humanitarian assistance to the people of Palestine both bilaterally and through UNRWA, despite the ban imposed on the agency by Israel. It contributes annually $5 million to UNRWA and has provided $27.5 million to the agency since 2020-21.“India’s developmental assistance, given to Palestine since 2014 is almost double of what was given in the preceding 65 years (around $42 million) and projects worth $40 million are in the pipeline,” said a diplomatic sourceWhile govt has faced some criticism for its flip-flop over the Gaza issue, like its decision in June this year to abstain from voting on a UNGA resolution for lasting and unconditional ceasefire, it believes India’s overall position, including its long-standing commitment to a 2-state solution, has remain unchanged.Indian authorities also see as significant that the govt hasn’t voted against any of the 175 resolutions on Israel-Palestine issues in the UN during past 10 years, suggesting India’s voting pattern at UN has remained unchanged. India was among the 142 countries that voted recently in favour of a UNGA resolution endorsing the New York Declaration that outlined tangible, irreversible and timebound steps for a 2-state solution.Since the Gaza conflict erupted in 2023, India has had to do a tough balancing act between its increasingly important relationship with Israel and its traditional support for the Palestinian cause. It has strongly condemned the Oct 7, 2023, terrorist strikes by Hamas, defending Israel’s right to defend itself from acts of terrorism, but equally condemned the loss of civilian lives in the Israel-Hamas war and sought respect for international humanitarian law.While the recent visit by Israeli hardliner Bezalel Smotrich raised eyebrows, govt sees it as a visit purely in his capacity as Israel’s finance minister to sign a bilateral investment agreement. The deal was under discussion for the past six years, before it was finalised last month. According to Indian authorities, the visit was meant to ramp up India’s economic and financial ties with Israel.“India remains concerned at the security situation and has called for a ceasefire, release of all hostages and peaceful resolution of the conflict through dialogue and diplomacy.At the same time, India has emphasized the need for safe, timely and sustained delivery of humanitarian assistance to the people of Palestine,” said a source, citing Palestinian ambassador Abdullah Shawesh’s recent remark that he is satisfied with India’s position. India has also been calling for efforts to bring Israel and Palestine closer for early resumption of direct peace negotiations.",
    "category": "politics"
  },
  {
    "title": "Jiya 1st autistic female to swim across Catalina Channel in US",
    "url": "https://timesofindia.indiatimes.com/india/jiya-1st-autistic-female-to-swim-across-catalina-channel-in-us/articleshow/124222820.cms",
    "source": "",
    "published": "2025-09-30T04:12:38+05:30",
    "text": "Jiya Rai\n\nPoll Which swimming challenge do you think is more impressive? Catalina Channel swim Mumbai to Goa relay swim\n\nMUMBAI: Jiya Rai, 17, daughter of Indian Navy sailor Madan Rai from Navy Nagar in Colaba, became the first female para swimmer with Autism Spectrum Disorder (ASD) to successfully swim across the Catalina Channel in the US solo. She completed the 34-km swim in 15 hours, one minute and 43 seconds.The officials said in the 100-year history of Catalina Channel swimming, Jiya is the first girl with ASD to achieve this feat. She began her solo swim at midnight on Sep 25 from Catalina Island and finished at San Pedro, California, in the afternoon of Sep 26.Jiya dedicated her swim to autism awareness. Her father, Madan Rai, told TOI: “She began swimming as therapy and went on to complete an epic 1,100km relay swim from Mumbai to Goa and back in 2022. Her journey earned her the Pradhan Mantri Rashtriya Bal Puraskar (2022) — India’s highest honour for young achievers.”Rai noted in the past 100 years, only about 500 persons have swum in the Catalina Channel. “The channel water is known for its treacherous currents, the water temperature in Sept is 18 degree Celsius and can cause hypothermia. There is a good chance of encountering jellyfish and dangerous sea animals. Swimming during dark hours is the most challenging part.”",
    "category": "politics"
  },
  {
    "title": "Govt intrigued at Ladakh violence even after ‘unprecedented’ vikas",
    "url": "https://timesofindia.indiatimes.com/india/govt-intrigued-at-ladakh-violence-even-after-unprecedented-vikas/articleshow/124220750.cms",
    "source": "",
    "published": "2025-09-30T03:25:06+05:30",
    "text": "Govt intrigued at Ladakh violence even after ‘unprecedented’ vikas\n\nPoll Do you believe the development initiatives in Ladakh since its UT status have effectively addressed local concerns? Yes No\n\nNEW DELHI/LEH: As Ladakh grapples with an uneasy calm after violent protests claimed four lives, senior govt functionaries are intrigued at the way the violence erupted as they argue that the region, once at the margins of governance, has seen “unprecedented development” since being carved out as a UT under the J&K Reorganisation Act in 2019.A senior official described it as ironical that fringe elements succeeded in inciting unrest when it was only after 2019 that the region was carved out of J&K to be constituted as an UT and that a concerted effort was made to fulfil popular aspirations related to connectivity, opportunities, infrastructure, new administrative structures. “People had celebrated the grant of UT status, yet a fringe succeeded in provoking unrest,” the official rued.The grant of UT status was followed by significant changes. Citing the measures, an official emphasised that the Centre has pumped resources into road, power, digital and social infrastructure. Key initiatives include the commissioning of 175 mobile towers, extension of the BharatNet project to all 193 gram panchayats, and progress on transmission lines linking Nubra, Zanskar and Changthang to the grid.Educational capacity was expanded with the setting up of University of Ladakh and Sindhu Central University, as well as the first medical college with 100 MBBS seats sanctioned in 2025.A separate UPSC exam centre in Leh has made career opportunities more accessible while literacy rates crossed 97% by 2024.In parallel, livelihood support has been targeted at traditional sectors. Under the PM Vishwakarma scheme, over 4,000 artisans — a big number for the small-sized UT — received credit and toolkits while nomadic pashmina herders were provided with predator-proof corrals and portable shelters.Tourism has also flourished, with arrivals doubling from 2.8 lakh in 2019 to over 5.2 lakh in 2023, boosted by projects such as Hanle Dark Sky Reserve and light-and-sound shows in Leh and Kargil.The Border Roads Organisation has accelerated strategic connectivity — Darbuk-Shyok-DBO road for year-round access to Galwan, Zoji-La tunnel, Nimmu–Padum–Darcha road, and upcoming Shinkun La tunnel, which will be the world’s highest. Together with Bilaspur–Manali–Leh railway project and Nyoma airfield, these projects underline Ladakh’s role at the frontier.The violence, sources feel, cannot be seen in isolation from long-standing demands around statehood, Sixth Schedule protections and resource control. Over the years, the Leh-based Apex Body and Kargil Democratic Alliance have sought constitutional safeguards to preserve Ladakh’s fragile demography and ecology.Analysts note that while local languages, Bhoti and Purgi, have been recognised as a step towards preserving linguistic heritage and ensuring inclusive governance, reservation for domiciles and that for women in hill councils was introduced. A High-Powered Committee was also constituted to address these concerns.",
    "category": "politics"
  },
  {
    "title": "BJP, Sena may go solo in Thane, Navi Mumbai civic elections",
    "url": "https://timesofindia.indiatimes.com/india/bjp-sena-may-go-solo-in-thane-navi-mumbai-civic-elections/articleshow/124220573.cms",
    "source": "",
    "published": "2025-09-30T03:02:59+05:30",
    "text": "File photo\n\nNAVI MUMBAI: Political observers suggest that the BJP-Shiv Sena alliance is on the verge of a fracture in Navi Mumbai and Thane with both parties likely to contest the municipal elections in the two cities separately. The divide between the allies has deepened amid mutual allegations as the civic elections approach.Deputy chief minister Eknath Shinde and industries minister Uday Samant recently launched a fierce attack on BJP ’s Airoli MLA Ganesh Naik ahead of the elections.The Shinde-Naik rivalry has only intensified over the past few days, signalling a potential face-to-face contest as the BJP-Shiv Sena alliance considers splitting for the municipal elections.Naik has previously criticised Shinde, besides declaring himself the tallest leader in Thane district.Shinde criticised Naik’s janata darbar model and his assertions of political dominance. He said that Thane, which was once a Congress stronghold, is now a Shiv Sena bastion. Shinde also targeted Naik’s family members, who hold key posts, emphasising that the Shiv Sena is a party of the common man.",
    "category": "politics"
  },
  {
    "title": "Meerut: Man kills kin for Rs 50cr insurance; 4th wife exposes plot",
    "url": "https://timesofindia.indiatimes.com/india/meerut-man-kills-kin-for-rs-50cr-insurance-4th-wife-exposes-plot/articleshow/124220577.cms",
    "source": "",
    "published": "2025-09-30T02:59:28+05:30",
    "text": "Representative image\n\nMEERUT: A man accused of murdering his first wife, father and mother to claim insurance worth Rs 50 crore has been arrested in Hapur, Uttar Pradesh, after his fourth wife alerted police about a series of suspicious deaths in the family.Vishal Singhal, 37, had already received Rs 1.5 crore in claims and was attempting to file more when police detained him along with his alleged accomplice. Singhal, a resident of Gangangar in Meerut, had convinced his fourth wife, Shreya, to sign multiple high-value life insurance policies.Her suspicions grew as she noticed patterns similar to those in reports she had read about an ongoing insurance scam being probed in Sambhal. When her concerns were dismissed by local police in Meerut, she reached out to the Sambhal police, who were already investigating fraud cases involving staged deaths across 11 states.",
    "category": "politics"
  }
]